{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Assume a computer has a precise clock which is not initialized. That is, the time on the computer\'s clock is the real time plus some constant offset. The computer has a network connection and we want to use that connection to determine the constant offset $B$.</p>\n\n<p>The simple method is that the computer sends a query to a time server, noting the local time $B + C_1$. The time server receives the query at a time $T$ and sends a reply containing $T$ back to the client, which receives it at a time $B + C_2$. Then $B + C_1 \\le T \\le B + C_2$, i.e. $T - C_2 \\le B \\le T - C_1$.</p>\n\n<p>If the network transmission time and the server processing time are symmetric, then $B = T - \\dfrac{C_1 + C_2}{2}$. As far as I know, <a href="http://en.wikipedia.org/wiki/Network_Time_Protocol">NTP</a>, the time synchronization protocol used in the wild, operates on this assumption.</p>\n\n<p>How can the precision be improved if the delays are not symmetric? Is there a way to measure this asymmetry in a typical Internet infrastructure?</p>\n', 'ViewCount': '1881', 'Title': 'Clock synchronization in a network with asymmetric delays', 'LastEditorUserId': '41', 'LastActivityDate': '2013-02-11T13:29:09.433', 'LastEditDate': '2012-03-07T20:25:33.727', 'AnswerCount': '5', 'CommentCount': '8', 'Score': '24', 'PostTypeId': '1', 'OwnerUserId': '39', 'Tags': '<clocks><distributed-systems><computer-networks>', 'CreationDate': '2012-03-07T16:59:53.447', 'FavoriteCount': '5', 'Id': '103'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>In computer networking and high-performance cluster computer design, network topology refers to the design of the way in which nodes are connected by links to form a communication network. Common network topologies include the mesh, torus, ring, star, tree, etc. These topologies can be studied analytically to determine properties related to their expected performance; such characteristics include diameter (maximal distance between a pair of nodes, in terms of the number of links which must be crossed if such nodes communicate), the average distance between nodes (over all pairs of nodes in the network), and the bisection bandwidth (the worst-case bandwidth between two halves of the network). Naturally, other topologies and metrics exist.</p>\n\n<p>Consider a network topology based on the Koch snowflake. The simplest incarnation of such a topology consists of three nodes and three links in a fully-connected setup. The diameter is 1, average distance is 1 (or 2/3, if you include communications inside a node), etc.</p>\n\n<p>The next incarnation of the topology consists of 12 nodes and 15 links. There are three clusters of three nodes fully, each cluster being fully connected by three links. Additionally, there are the three original nodes, connecting the three clusters using six additional links.</p>\n\n<p>In fact, the number of nodes and links in incarnation $k$ are described by the following recurrence relations:\n$$N(1) = 3$$\n$$L(1) = 3$$\n$$N(k+1) = N(k) + 3L(k)$$\n$$L(k+1) = 5L(k)$$\nHopefully, the shape of this topology is clear; incarnation $k$ looks like the $k^{th}$ incarnation of the Koch snowflake. (A key difference is that for what I have in mind, I am actually keeping the link between the 1/3 and 2/3 nodes on successive iterations, so that each "triangle" is fully connected and the above recurrence relations hold).</p>\n\n<p>Now for the question:</p>\n\n<blockquote>\n  <p>Has this network topology been studied, and if so, what is it called? If it has been studied extensively, are there any references? If not, what are the diameter, average distance and bisection bandwidth of this topology? How do these compare to other kinds of topologies, in terms of cost (links) &amp; benefit?</p>\n</blockquote>\n\n<p>I have heard of a "star of stars" topology, which I think is similar, but not identical, to this. If anything, this seems to be more of a "ring of rings", or something along those lines. Naturally, tweaks could be made to the definition of this topology, and more advanced questions could be asked (for instance, we could assign different bandwidths to links introduced at earlier stages, or discuss scheduling or data placement for such a topology). More generally, I am also interested in any good references for exotic or little-studied network topologies (regardless of practicality). </p>\n\n<p>Again, apologies if this demonstrates ignorance of relevant research results, and any insights are appreciated.</p>\n', 'ViewCount': '148', 'Title': 'Analysis of and references for Koch-snowflake-like (and other exotic) network topologies', 'LastEditorUserId': '69', 'LastActivityDate': '2012-05-09T16:27:06.473', 'LastEditDate': '2012-03-09T16:24:00.603', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '8', 'PostTypeId': '1', 'OwnerUserId': '69', 'Tags': '<computer-networks><network-topology>', 'CreationDate': '2012-03-09T05:30:42.347', 'FavoriteCount': '1', 'Id': '149'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>This is a puzzle about measuring network latency that I created. I believe the solution is that it\'s impossible, but friends disagree. I\'m looking for convincing explanations either way. (Though it is posed as a puzzle I think it fits on this web site because of its applicability to the design and experience of communication protocols such as in online games, not to mention NTP.)</p>\n\n<p>Suppose two robots are in two rooms, connected by a network with differing one-way latencies as shown in the graphic below. When robot A sends a message to robot B it takes 3 seconds for it to arrive, but when robot B sends a message to robot A it takes 1 second to arrive. The latencies never vary.</p>\n\n<p>The robots are identical and do not have a shared clock, though they can measure the passage of time (e.g. they have stop watches). They do not know which of them is robot A (whose messages are delayed 3s) and which is robot B (whose messages are delayed by 1s).</p>\n\n<p>A protocol to discover the round trip time is \'when receiving TICK send TOCK, start watch, send TICK, await TOCK, stop watch, record time difference (4s)\'.</p>\n\n<p>Is there a protocol to determine the one way trip delays? Can the robots discover which of them has the longer message sending delay?</p>\n\n<p><img src="http://i.stack.imgur.com/uYIGW.png" alt="Two robots one asymmetric network"></p>\n', 'ViewCount': '668', 'Title': 'Measuring one way network latency', 'LastEditorUserId': '41', 'LastActivityDate': '2013-07-10T20:57:00.673', 'LastEditDate': '2012-03-25T17:06:14.083', 'AnswerCount': '2', 'CommentCount': '5', 'Score': '11', 'PostTypeId': '1', 'OwnerUserId': '535', 'Tags': '<computer-networks><protocols><distributed-systems>', 'CreationDate': '2012-03-21T12:54:47.823', 'FavoriteCount': '5', 'Id': '602'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>How does the password that we enter (to connect to a wireless network) encrypt the data on the wireless network?</p>\n\n<p>Through my reading I am not sure if the password that we enter is the same as the passphrase. If that is right then how can the passphrase generate the four WEP keys?</p>\n\n<p>I understand how the four keys work in WEP and how they encrypt the data. Also, I know how WPA's keys encrypt the data but the only thing I have to know is: </p>\n\n<blockquote>\n  <p>what is the benefit of the password that we enter to get access to the network, and how does this password help in encrypting the data?</p>\n</blockquote>\n", 'ViewCount': '1009', 'Title': 'How does a wifi password encrypt data using WEP and WPA?', 'LastEditorUserId': '41', 'LastActivityDate': '2012-03-25T14:54:04.653', 'LastEditDate': '2012-03-25T14:54:04.653', 'AnswerCount': '2', 'CommentCount': '4', 'Score': '9', 'PostTypeId': '1', 'OwnerUserId': '701', 'Tags': '<cryptography><computer-networks><encryption><security>', 'CreationDate': '2012-03-23T19:41:23.180', 'FavoriteCount': '1', 'Id': '704'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I wanted to confirm something and will appreciate your help. Suppose we have three nodes called A,B and C. All are connected to a switch whose port supports 1 Gbps. Now suppose, Node's A network card is 100 Mbps while the the remaining have a 1 Gbps. Following are the constraints;</p>\n\n<ol>\n<li>A can send B only with a maximum of 100 Mbps.</li>\n<li>A can send C only with a maximum of 80 Mbps.</li>\n</ol>\n\n<p>Now if I were to broadcast a 2 GB file;</p>\n\n<ol>\n<li>It would reach B after approx 2.73 minutes.</li>\n<li>It would reach C after approx 3.41 minutes.</li>\n</ol>\n\n<p>Now even if I replace node A's network card with 1 Gbps with the same constraints, I would still get the same results. Have I got it right? </p>\n", 'ViewCount': '46', 'Title': 'How will broadcast behave with a certain capacity?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-05-10T15:14:42.180', 'LastEditDate': '2012-05-10T15:14:42.180', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '1289', 'Tags': '<computer-networks>', 'CreationDate': '2012-05-08T07:46:37.443', 'Id': '1727'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am currently reviewing the potentials of cloud computing regarding energy efficiency and green IT. In connection with this review I am having a look on techniques for increasing energy-efficiency in data centers (computing), hardware, networking and storage devices.</p>\n\n<p>Specificially for computing/servers I have found already a few:</p>\n\n<ul>\n<li>energy-aware scheduling techniques utilizing frequency and voltage scaling </li>\n<li>virtualization to consolidate server resources</li>\n<li>energy-saving hardware, e.g. ACPI, several processor techniques, especially for mobile devices etc.</li>\n</ul>\n\n<p>However, for networking devices it is rather hard to get information about energy-saving technologies. I have read that people are thinking about new protocols and alternative routing methods to be able to switch off hardware if the network is under low load. Does anyone know of such examples? </p>\n\n<p>Which other points should be added, either for networking or computing</p>\n', 'ViewCount': '146', 'Title': 'What techniques exist for energy-efficient computing and networking?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-07-24T15:04:08.463', 'LastEditDate': '2012-05-10T15:17:18.700', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '1413', 'Tags': '<reference-request><computer-architecture><operating-systems><computer-networks><power-consumption>', 'CreationDate': '2012-05-08T10:05:00.307', 'Id': '1729'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Is there any way to estimate how much data is added to the world wide web each second? Are there any studies about this? </p>\n', 'ViewCount': '230', 'Title': 'What is the growth rate of the world wide web?', 'LastEditorUserId': '568', 'LastActivityDate': '2012-10-05T22:08:54.367', 'LastEditDate': '2012-05-18T23:36:08.857', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '1538', 'Tags': '<computer-networks>', 'CreationDate': '2012-05-18T04:46:49.363', 'FavoriteCount': '1', 'Id': '1903'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'ViewCount': '222', 'Title': 'Why is it seemingly easier to resume torrent downloads than browser downloads?', 'LastEditDate': '2012-06-07T22:37:41.390', 'AnswerCount': '3', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '1414', 'FavoriteCount': '0', 'Body': '<p>I really wonder how torrent downloads can be resumed at later point of time.\nIf such a technology exists, then why is it not possible in browsers?</p>\n\n<p>It is often not possible to pause a browser download so that it can be resumed at a later point of time. Often, the download will start again from the beginning. But in the case of a torrent download, you can resume anytime.</p>\n\n<p>One reason I could think of is that a browser makes an HTTP connection to the server which contains the file, and when this connection breaks, there is no data regarding how much file was saved so no resume is possible.</p>\n\n<p>Is there a fundamental reason why torrent downloads are easier to resume than web downloads?</p>\n', 'Tags': '<computer-networks><communication-protocols>', 'LastEditorUserId': '98', 'LastActivityDate': '2012-06-08T00:40:40.473', 'CommentCount': '2', 'AcceptedAnswerId': '2268', 'CreationDate': '2012-06-07T11:05:30.010', 'Id': '2251'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': u'<p>IPv6 addresses in the form of <code>862A:7373:3386:BF1F:8D77:D3D2:220F:D7E0</code> are much harder to memorize or even transcribe than the 4 octets of IPv4.  </p>\n\n<p>There <a href="http://blog.jgc.org/2011/07/pronounceable-ipv6-addresses-wpa2-psk.html?m=1" rel="nofollow">have</a> <a href="http://www.halfbakery.com/idea/IPv6_20Worded_20Addresses#1260513928" rel="nofollow">been</a> attempts to mitigate this, making IPv6 addresses somehow more memorable.</p>\n\n<p>Is there an intentionally-weak hashing function which could be reversed to find that the phrase, say, <a href="http://en.wikipedia.org/wiki/Dissociated_press" rel="nofollow">"This is relatively benign and easy to spot if the phrase is bent so as to be not worth paying"</a> would hash to a target IPv6 address?  The hash would, of course, have many colliding inputs to choose from, and a potentially more memorable sentence, such as this example phrase, could be automatically offered.</p>\n\n<p>I guess there are two parts: First a weak hash with good distribution in both directions.  Second is an algorithm for selecting memorable phrases from among the many collisions (short, consisting of words from a specified language, perhaps even following a simplified grammar).</p>\n\n<p>Although the hash function would need to be weak, I don\'t doubt that the effort is still significant - however, once the phrase is known, the computation of the hash to the target address is very quick.</p>\n\n<p><strong>EDIT</strong></p>\n\n<p>I found this related idea, <a href="https://en.wikipedia.org/wiki/Piphilology" rel="nofollow">Piphilology</a>, for memorizing some digits of π:</p>\n\n<blockquote>\n  <p>How I wish a drink, alcoholic of course, after the heavy lectures involving quantum mechanics!</p>\n</blockquote>\n', 'ViewCount': '301', 'Title': 'Weak hashing function for memorable IPv6 addresses', 'LastEditorUserId': '41', 'LastActivityDate': '2013-12-18T02:30:58.523', 'LastEditDate': '2013-07-20T09:19:35.660', 'AnswerCount': '1', 'CommentCount': '4', 'Score': '9', 'PostTypeId': '1', 'OwnerUserId': '762', 'Tags': '<cryptography><computer-networks><hash><user-interface>', 'CreationDate': '2012-07-15T17:57:04.403', 'FavoriteCount': '3', 'Id': '2752'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>At my current project I had a network problem come up for which I could not find a solution. In a peer-to-peer network I needed to send an action to all peers, and each peer was to act on it only if it could verify that all other peers would also act on it.</p>\n\n<p>That is, given a network of peers $P = { P_1, ..., P_n }$. We wish to send, from some source peer $P_s$ a message to all other peers. This message contains an action which must be performed. The peer should perform this action if and only if every other peer will perform the action. That is, it performs the action if it can verify that all other peers will also have receipt of the action and can perform the same verification.</p>\n\n<p>The problem is subject to these conditions:</p>\n\n<ol>\n<li>There is no implicit message delivery guarantee: if $P_x$ sends a message to $P_y$ there is no way for $P_x$ to know if $P_y$ gets the message. (Of course $P_y$ can send a receipt, but that receipt is subject to the same constraint)</li>\n<li>Additional messages with any payload may be created.</li>\n<li>There is no total ordering on the messages received by peers. Messages can arrive in a different time-order than which they were sent. This time-order may be unique per peer. <em>Two messages sent in order from $P_x$ to $P_y$ are very unlikely to arrive out of order.</em></li>\n<li>Messages can arrive at any point in the future (so not only are they not ordered, they can be indefintely delayed). A message cannot inherently be detected as lost. <em>Most messages will be delivered quickly, or truly lost.</em></li>\n<li>Each peer has a synchronized clock. It is accurate enough in the domain of scheduling an action and to approximately measure transmission delays. It is however not accurate enough to establish a total ordering on messages using timestamps.</li>\n</ol>\n\n<p>I was not able to find a solution. I'm interested in a <em>guarantee</em> and not simply a high probability of being correct (which can be done simply be repeatedly sending confirmations from peer to peer and rejections upon any likely loss.) My stumbling block is the inability to verify that any particular message actually arrived. So even if $P_x$ determines there is an erorr, there is no guaranteed way to tell the other peers about it.</p>\n\n<p>A negative confirmation is also acceptable. I have a suspicion that a guarantee cannot actually be achieved, only an arbitrarily high probability.</p>\n", 'ViewCount': '71', 'Title': 'Message receipt verification in a cluster', 'LastEditorUserId': '39', 'LastActivityDate': '2012-08-03T09:56:09.247', 'LastEditDate': '2012-08-03T09:56:09.247', 'AnswerCount': '2', 'CommentCount': '0', 'AcceptedAnswerId': '2802', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '1642', 'Tags': '<algorithms><distributed-systems><computer-networks><fault-tolerance>', 'CreationDate': '2012-07-17T07:56:19.143', 'Id': '2784'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I'm not even sure if this is the right StackExchange to post this, but it seems like sentiment analysis would go here.</p>\n\n<p>What would be the best approach to determine if two people on Twitter are actually friends?</p>\n\n<p>I think that the first criteria would be that they are following each other. This would eliminate all of the celebrities, companies, etc. that a person follows.</p>\n\n<p>The second criteria could be physical proximity to one another. If two people tweet from the same general areas, then there's probably a higher chance that they actually know each other.</p>\n\n<p>After that, I'm not sure what criteria I should look for. Would sentiment analysis of their tweets to each other be a viable option? With that friendly sentiment could indicate that they actually know each other.</p>\n", 'ViewCount': '133', 'Title': 'Analyzing Twitter Relationships', 'LastEditorUserId': '41', 'LastActivityDate': '2012-10-25T01:49:05.057', 'LastEditDate': '2012-08-06T03:48:54.740', 'AnswerCount': '2', 'CommentCount': '4', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '2214', 'Tags': '<algorithms><machine-learning><computer-networks><social-networks>', 'CreationDate': '2012-08-05T17:56:11.877', 'Id': '3050'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'ViewCount': '569', 'Title': 'Graph Theory and computer networks', 'LastEditDate': '2012-11-17T09:25:32.120', 'AnswerCount': '1', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '4624', 'Body': '<p>What are the various graph theory  techniques which are used in modelling of computer networks? Secondly, Will routing algorithms like bellmanford etc also be considered to be part of modelling networks? In short , I want to know the algorithm names which are used in modelling computer networks.</p>\n', 'ClosedDate': '2012-11-19T22:16:00.363', 'Tags': '<graph-theory><computer-networks>', 'LastEditorUserId': '4624', 'LastActivityDate': '2012-11-17T15:24:18.903', 'CommentCount': '2', 'AcceptedAnswerId': '6716', 'CreationDate': '2012-11-17T07:20:05.667', 'Id': '6707'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I'm reading a book about computer network theory, and one topic is discusses is routing algorithms.  It only mentions (probably not intentionally) how routers participate in forming the understood network topology stored in each routers memory - the routing tables. </p>\n\n<p>So this brings me to my question, do Host acts like dedicated routers in this case and participate in and become part of that understood topology of the network in nearby routers?</p>\n\n<p>For example, it says that routers communicate with each other to form their routing tables to find the best path. Do <strong>hosts as end user machines</strong> find themselves in this routing table (<strong>as an entry in dedicated router, routing tables</strong>) or routing topology?  Do they participate in forming it?</p>\n\n<p>Likewise do Computer Hosts, have entries for nearby dedicate routers in their routing tables? I'm trying to find the relation ship between a router and a host in the this process.</p>\n\n<p>The issue I'm having, is if they don't participate in this process, how do the routers not where the end user machines are in the topology?</p>\n\n<p>Thanks :-)</p>\n", 'ViewCount': '66', 'Title': 'Routing Algorithms and Hosts', 'LastEditorUserId': '4772', 'LastActivityDate': '2012-11-28T04:30:26.203', 'LastEditDate': '2012-11-28T03:09:35.070', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '6979', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '4772', 'Tags': '<computer-networks>', 'CreationDate': '2012-11-28T02:46:32.140', 'Id': '6977'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': u'<blockquote>\n  <p>Computer Networking:\n  A Top Down Approach\n  Featuring the Internet,\n  Jim Kurose, Keith Ross\n  Addison-Wesley 4nd edition , page -223.</p>\n</blockquote>\n\n<p>Also <a href="https://sites.google.com/site/amirherzberg/introductiontocommunicationnetworks89-35/89-350-introduction-to-communication-neteworks---lectures/s2transport.pdf?attredirects=0&amp;d=1" rel="nofollow">here</a> slide 60 .</p>\n\n<p>RDT2.1 (Reliable data transfer) -</p>\n\n<pre><code>Sender(s):\nstate=ready; i=0;\nOn rdt_send(d,m):\n    if state=ready\n    then\n    { p=&lt;s,d,m,i,\n    EDC(s||d||m||i)&gt;;\n    udt_send(p);\n    state=busy; }\nOn udt_deliver(a)\n     If a=&lt;“ack”,EDC(“ack”)&gt;\n    then\n    { i++;\n    state=ready; }\n    else udt_send(p);\n</code></pre>\n\n<p>When the <code>Sender</code> side is in <code>state=ready</code> , does he still listener to "ack" recived from the <code>Reciver</code> ? </p>\n\n<p>I need to know this , cause if so it seems that the <code>Sender</code> can get duplicate "ack"\'s from the <code>reciver</code> and inc the <code>i</code> without sending any packet mainwhile . </p>\n', 'ViewCount': '62', 'Title': 'RDT2.1 - does the Sender listener to "ack" even though state=ready?', 'LastEditorUserId': '4409', 'LastActivityDate': '2012-12-30T08:00:46.263', 'LastEditDate': '2012-12-30T08:00:46.263', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '7648', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '4409', 'Tags': '<computer-networks>', 'CreationDate': '2012-12-30T02:51:41.407', 'Id': '7647'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Which tools or softwares are mostly used for the purpose of modeling a computer network?</p>\n', 'ViewCount': '78', 'Title': 'Names of Softwares used for modeling', 'LastActivityDate': '2013-01-01T19:24:26.887', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '7680', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '4624', 'Tags': '<computer-networks>', 'CreationDate': '2013-01-01T17:37:15.933', 'Id': '7679'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>In peer-to-peer (P2P) networks nodes are interconnected with each other. In client/server (C/S) networks clients talks to the server. If in a C/S network clients also want to talk with each other (such as in a multiplayer online game), then clients would have to communicate through the server.</p>\n\n<p>Given these, is it possible determine which architecture is more bandwidth consuming?</p>\n', 'ViewCount': '51', 'Title': 'P2P and C/S, is it possible to determine which one is more bandwidth consuming?', 'LastActivityDate': '2013-01-27T04:14:08.647', 'AnswerCount': '2', 'CommentCount': '0', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '5387', 'Tags': '<computer-networks><network-topology>', 'CreationDate': '2013-01-12T03:53:39.057', 'Id': '7895'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I\'m looking at collision detection in communication protocols, in particular <a href="http://en.wikipedia.org/wiki/Carrier_sense_multiple_access_with_collision_detection" rel="nofollow">Carrier sense multiple access with collision detection (CSMA/CD)</a>. According to what I\'ve read on Wikipedia, a collision seems to cause the wave of the outgoing signal and the wave of the incoming signal to overlap. Thus, the signal has values with more amplitude than allowed for a "1-bit". This could be used as a working collision detection algorithm.</p>\n\n<p>However, what\'s the use of the "Jam signal", as explained in <a href="http://en.wikipedia.org/wiki/Carrier_sense_multiple_access_with_collision_detection" rel="nofollow">the same Wikipedia article</a>, then? It says that the CRC has to be faulted, but we already have a collision detection algorithm.</p>\n', 'ViewCount': '308', 'Title': 'Jamming signal useless in CSMA / CD?', 'LastEditorUserId': '39', 'LastActivityDate': '2013-01-15T20:44:57.460', 'LastEditDate': '2013-01-15T20:44:57.460', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '8949', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '3181', 'Tags': '<computer-networks><communication-protocols><encoding-scheme>', 'CreationDate': '2013-01-15T07:55:13.747', 'Id': '8943'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': u'<p>I\'m having difficulties understanding the solution to the following question:</p>\n\n<blockquote>\n  <p>Consider the following description of a LAN:</p>\n  \n  <p>The main Internet connection is connected to our gateway router. This\n  in turn is part of the backbone network on the 65.21.1.0/24 subnet.\n  The backbone also supports two further routers SALES and RESEARCH.\n  There is one Sales subnetwork 65.21.6.0/23, and two research\n  subnetworks 65.21.100.0/24 and 65.21.200.0/26.</p>\n\n<pre><code>If the Interface addresses are:   \n\n• i1–65.21.1.1\n• i2–65.21.1.2\n• i3–65.21.6.1\n• i4–65.21.1.3\n• i5–65.21.100.1\n• i6–65.21.200.1\n</code></pre>\n  \n  <p>What are the routing tables for the SALES and RESEARCH routers?</p>\n  \n  <p><img src="http://i.stack.imgur.com/XS2Vu.gif" alt="enter image description here"></p>\n</blockquote>\n\n<p>How is the <strong>via</strong> and <strong>interface</strong> column derived in the solution?</p>\n\n<p><img src="http://i.stack.imgur.com/PBm8D.png" alt="enter image description here"></p>\n\n<p>Thanks in advance.</p>\n', 'ViewCount': '159', 'Title': 'Simple routing table question', 'LastEditorUserId': '98', 'LastActivityDate': '2013-01-19T12:20:38.017', 'LastEditDate': '2013-01-17T13:35:13.390', 'AnswerCount': '1', 'CommentCount': '2', 'AcceptedAnswerId': '9039', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1165', 'Tags': '<algorithms><computer-networks><routing>', 'CreationDate': '2013-01-17T09:43:21.247', 'Id': '8984'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>How do I calculate RTT, do I start to measure the time from the beginning of the segment transmition or from the moment all the segment had been transmitted? </p>\n\n<p>The end time is the moment the sender gets the "ACK".   </p>\n', 'ViewCount': '2165', 'Title': 'RTT (Round Trip Time) calculation', 'LastEditorUserId': '683', 'LastActivityDate': '2013-01-29T16:41:48.983', 'LastEditDate': '2013-01-28T14:39:43.307', 'AnswerCount': '3', 'CommentCount': '3', 'AcceptedAnswerId': '9256', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '4409', 'Tags': '<computer-networks>', 'CreationDate': '2013-01-28T14:07:58.950', 'Id': '9249'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I read a question from my recitation about optimal buffer size. As solution there is a furmula for calculating the optimal buffer size; I\'m not sure about one of its parameters. The formula is</p>\n\n<p>$\\quad \\operatorname{Buffer}_{\\text{optimal}} =  \\frac{\\operatorname{Buffer}_{\\text{current}}}{1-\\frac{R_{\\text{app}}}{R_{\\min}}}$ </p>\n\n<p>Where </p>\n\n<ul>\n<li>$\\operatorname{Buffer}_{\\text{optimal}}$ is the optimal buffer size we want to calculate.</li>\n<li>$\\operatorname{Buffer}_{\\text{current}}$ is the current buffer size.</li>\n<li>$R_{\\text{app}}$ is the rate the application reads data from the buffer at. </li>\n<li>$R_{\\min}$ -- this is the one I\'m not sure about.</li>\n</ul>\n\n<p>The example problem is this: </p>\n\n<blockquote>\n  <p>Alice connects to web server and downloads a file of 12KB size from\n  the server. There is a router between them. The transmission rate \n  between Alice and router is 400,000B/s and the transmission rate between \n  router and server is 1MB/s. Buffer size in the router is 4KB, and buffer \n  size in Alice is 3KB. The rate the application reads from Alice buffer with\n  is 100KBps.\n  <img src="http://i.stack.imgur.com/UFdgt.png" alt="enter image description here"> \n  Calculate the optimal buffer size for Alice as a fuction of router buffer\n  size and free space at the buffer.</p>\n</blockquote>\n\n<p>So as described in the solution, according to the above formula the solution is</p>\n\n<p>$\\qquad \\operatorname{Buffer}_{\\text{optimal}} = \\frac{3*10^3}{1-\\frac{10^5}{4*10^5}}$ </p>\n\n<p>So what $ R_{\\min} $ could be  ?</p>\n', 'ViewCount': '42', 'Title': 'What is $R_\\min$ in this formulat for optimal buffer size?', 'LastEditorUserId': '98', 'LastActivityDate': '2013-02-02T21:15:17.650', 'LastEditDate': '2013-01-31T14:14:21.507', 'AnswerCount': '1', 'CommentCount': '1', 'AcceptedAnswerId': '9359', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '4409', 'Tags': '<computer-networks>', 'CreationDate': '2013-01-31T08:11:55.363', 'Id': '9344'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>This is what I know:</p>\n\n<ul>\n<li>GBN weakness is the fact that when the window size is too large, the number of packets in the pipeline grows and one packet error causes the retransmition of many packets unnecessarily. </li>\n<li>Selective Repeat solves this by acknowleding just the suspicious packets, which sightly makes performance better, but if a wrong window size is chosen, then the reciever doesn't know if a packet is being retransmitted or another packet is being sent by first time.</li>\n</ul>\n\n<p>So, back to the question, what other important performance differences exists between these protocols?</p>\n", 'ViewCount': '3018', 'Title': 'Performance differences between Go-Back-N and Selective Repeat ARQ protocols?', 'LastEditorUserId': '7492', 'LastActivityDate': '2013-05-12T07:31:21.147', 'LastEditDate': '2013-05-05T15:45:27.530', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '11960', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '7492', 'Tags': '<computer-networks><communication-protocols>', 'CreationDate': '2013-05-02T02:20:04.770', 'Id': '11715'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>If a school has an IP that's like 10.0.x.x, and a department in that school has it's own site that's an extension of the school's site, does that department's IP just change the last two numbers in the IP?\nDoes the school have to purchase extra domain space? \nCould I have additional addresses established at my IP address, just by changing the last numbers?\nAm I completely wrong with my idea of IP numbers?</p>\n", 'ViewCount': '50', 'Title': 'IP addresses and Subdomains?', 'LastActivityDate': '2013-07-18T08:45:44.210', 'AnswerCount': '1', 'CommentCount': '2', 'AcceptedAnswerId': '13330', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '8722', 'Tags': '<computer-networks>', 'CreationDate': '2013-07-18T05:40:57.253', 'Id': '13326'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Consider 2 stations that share the same bus. Both stations are perfect synchronized each other and when they have packets to transmit, they are starting the transmission in the beginning of a same slot. Transmission is as follows: when base $i$ has a packet to transmit attempts with probability $p_i, i=1,2$. Different stations make the random selection independently and corresponding probabilities are $p_1=0.5, p_2=0.25$. Initially the station 1 has 2 packets for station 2, while the other has no package. </p>\n\n<p>What is the average number of slots in order all packets reach their destinations? Then if station 1 has 1 packet for station 2 and station 2 has 1 packet for station 1, what is the average number of slots? We are using slotted-Aloha.</p>\n', 'ViewCount': '328', 'Title': 'Average number of slots needed in slotted-Aloha', 'LastEditorUserId': '472', 'LastActivityDate': '2013-07-31T18:55:28.610', 'LastEditDate': '2013-07-31T18:55:28.610', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '13517', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '9412', 'Tags': '<probability-theory><computer-networks>', 'CreationDate': '2013-07-29T19:23:59.420', 'Id': '13498'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>The <a href="http://rads.stackoverflow.com/amzn/click/0136079679" rel="nofollow">Kurose &amp; Ross book</a> uses "store-and-forward delay" as a synonym for the transmission delay of a packet over a network link. </p>\n\n<p>As a newcomer to computer networks, it isn\'t immediately obvious to me how these two terms are synonymous. My current understanding is that if not for the store-and-forward behavior of packet switches, the transmission delay of a link would be negligible as it would be pipelined with the propagation delay of the previous link; i.e. as the bits propagate across Link A, they are transmitted and stream into Link B. However, due to store-and-forward, no bits are transmitted onto Link B before all the bits have crossed Link A, and hence, we need to add the transmission delay of Link B.</p>\n\n<p>Is this correct?</p>\n', 'ViewCount': '830', 'Title': 'Transmission (Store and Forward) Delay', 'LastActivityDate': '2013-07-30T21:16:31.517', 'AnswerCount': '2', 'CommentCount': '0', 'AcceptedAnswerId': '13525', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '1025', 'Tags': '<computer-networks>', 'CreationDate': '2013-07-29T21:27:23.473', 'Id': '13501'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'ViewCount': '163', 'Title': "Little's law and average time on a system with a switch", 'LastEditDate': '2013-08-14T20:56:35.160', 'AnswerCount': '1', 'Score': '-1', 'PostTypeId': '1', 'OwnerUserId': '9412', 'FavoriteCount': '0', 'Body': '<p>We have a switch with $2$ lines of input and $2$ output. Each line is $10 Mbps$. The size of packets is fixed and is $1KB$. The $1^{st}$ line of input is active (transferring packets) $40\\%$ of the time, while the $2{nd}$ line is active $70\\%$ of the time. $\\frac{1}{4}$ of <strong>packets of input $1$</strong> (with arrival) directed to buffer of output line $1$, while the $\\frac{3}{4}$ directed to buffer of output line $2$. Respectively $\\frac{1}{2}$ of <strong>packets of input $2$</strong> go to buffer 1 and $\\frac{1}{2}$ to buffer $2$. Buffers $1$ and $2$ are monitored and we know that tha average number of packets in buffer $1$ is $3$ packets and in buffer $2$ is $4.5$ packets.There is also an external measurement system that measures the total time of packet input $1$ to the switch.Based on these measurements calculated the average time of packets of input $1$ in the system for those that are directed to output $1$ is $5mse$c and to output $2$ is $7msec$ . Find the average residence time of packets of input line $2$ that are directed to buffer $1$ and the average time in the system (for the same packets)</p>\n\n<p>note: the residence time of one packet on switch, is the time spent on buffer plus the transmission time from the output line</p>\n\n<p>Consider these cases:\n1) consider packets sit in the buffer until they are done being transmitted\n2) assume the transmitter works on one packet at a time and removes the packet from the buffer while it is working on it</p>\n', 'Tags': '<probability-theory><computer-networks>', 'LastEditorUserId': '9412', 'LastActivityDate': '2013-08-14T20:56:35.160', 'CommentCount': '2', 'AcceptedAnswerId': '13714', 'CreationDate': '2013-08-11T12:35:58.580', 'Id': '13705'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>What is the difference between encoding and modulation?</p>\n\n<p>I have seen these terms used sometimes inter-changeably and sometimes differently (the ratio is 50:50).</p>\n\n<p>Can somebody clearly explain this with some non-technical and technical examples both? I have searched this a lot on net and in the end I end up scratching my head.</p>\n', 'ViewCount': '135', 'Title': 'Difference between encoding and modulation in transmission', 'LastEditorUserId': '98', 'LastActivityDate': '2014-02-07T08:02:58.030', 'LastEditDate': '2014-02-07T08:02:58.030', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '8484', 'Tags': '<terminology><computer-networks>', 'CreationDate': '2013-08-22T08:26:57.430', 'Id': '13862'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>Suppose I type in the website <code> www.youtube.com.</code> The computer first asks a local domain name server (DNS) what the IP address of this website is. If it can't find it, it then asks the root server, etc. This is recursive querying. </p>\n\n<p>How does DNS work if there is no recursive querying? Is the root server the only one that is used to find the IP address of the website?</p>\n", 'ViewCount': '208', 'Title': 'How does DNS work if there is no recursive querying?', 'LastEditorUserId': '472', 'LastActivityDate': '2013-09-20T18:27:37.903', 'LastEditDate': '2013-09-19T13:35:42.077', 'AnswerCount': '2', 'CommentCount': '0', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '10224', 'Tags': '<computer-networks><communication-protocols>', 'CreationDate': '2013-09-19T13:07:06.660', 'Id': '14440'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>The TCP(Transmission Control Protocol) delayed duplicate problem is discussed in Tannenbaum\'s "Computer Networks." The discussion references Tomlinson (1975) improved by Sunshine and Dayal (1978). Basically, from what I could make out it uses a ToD (Time of the day) clock to uniquely number packets and ensure that, if packet lifetime is $T$ secs, then no new packets have the same sequence number within $T$ secs. To elucidate the above fact a graph between sequence numbers and time is drawn which shows the linear relation and marks a Forbidden region, entering which produces duplicate packets. </p>\n\n<p>So here are my questions: </p>\n\n<ol>\n<li>How exactly does entering the forbidden region produces the delayed duplicates?</li>\n<li><p>If I wanted to quantify the discussion with the following parameters:</p>\n\n<p>a) ToD clock size - 32 bits(keeps running even when the host is down) </p>\n\n<p>b) clock increases once per milliseconds </p>\n\n<p>c) maximum packet lifetime - 64 s </p></li>\n</ol>\n\n<p>How would I find the minimum and maximum permissible sequence number generation rate?</p>\n', 'ViewCount': '120', 'Title': 'TCP delayed duplicate problem', 'LastEditorUserId': '2253', 'LastActivityDate': '2013-09-26T03:20:37.030', 'LastEditDate': '2013-09-26T03:20:37.030', 'AnswerCount': '0', 'CommentCount': '0', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '10329', 'Tags': '<computer-networks>', 'CreationDate': '2013-09-25T15:22:16.693', 'Id': '14595'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am doing bachelors in Electronics &amp; Communication Engg.. But most of my work happened to be in Web development.. I am thinking to do my bachelor thesis which very closely overlaps with my recent work.</p>\n\n<p>Are there any specific areas in CS, EE (may be Computer Networking in broad terms) that I can take up? </p>\n', 'ViewCount': '47', 'Title': 'What areas in EE overlap closely with CS', 'LastEditorUserId': '8079', 'LastActivityDate': '2013-10-02T17:03:51.437', 'LastEditDate': '2013-10-02T15:19:10.950', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '8079', 'Tags': '<computer-networks><research>', 'CreationDate': '2013-10-02T14:36:18.053', 'Id': '14753'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I want to know why error control is used in transport layer although it is used in data link layer?While data link layer has all data came from upper layers in its frames so its error control should be sufficient.</p>\n', 'ViewCount': '193', 'Title': 'need of error control in transport layer', 'LastActivityDate': '2013-10-19T00:16:27.373', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '10380', 'Tags': '<computer-networks>', 'CreationDate': '2013-10-18T17:58:04.127', 'Id': '16205'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I want to know difference between propagation speed and bandwidth in digital communication.I know bandwidth is no of bits in one second and propagation speed of signal is distance traveled by signal is one second.Is there any relation between them or they are totally different.Can anyone tell me exact definition to differentiate these twos.</p>\n', 'ViewCount': '74', 'Title': 'difference between propagation speed and bandwidth in digital communication', 'LastActivityDate': '2013-10-25T12:27:30.913', 'AnswerCount': '1', 'CommentCount': '2', 'AcceptedAnswerId': '16424', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '10380', 'Tags': '<computer-networks>', 'CreationDate': '2013-10-24T15:41:48.750', 'Id': '16402'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I\'m trying to generate a random but realistic network topology so I can test the performance of some routing algorithms. I came across Waxman\'s model described in <a href="http://www.huaxiaspace.net/academic/classes/fa00/cse202/project/08Waxman.pdf" rel="nofollow">Routing of Multipoint Connections</a>, which seems pretty simple:</p>\n\n<ol>\n<li>Distribute $N$ nodes randomly across a plane (uniform in x and y).</li>\n<li>For each pair of nodes, generate an edge between them with the probability $ P = \\beta \\exp \\frac{-d}{L\\alpha}$, where $d$ is the euclidean distance between the nodes, $L$ is the maximum distance between two nodes, and $\\alpha$ and $\\beta$ are parameters in the range $(0, 1]$.</li>\n</ol>\n\n<p>I\'ve implemented my current understanding of Waxman\'s algorithm as <a href="http://codepen.io/blendmaster/full/uqibt" rel="nofollow">a simple web-based demo</a>, which visualizes a generated topology from chosen parameters $\\alpha$, $\\beta$, and $N$.</p>\n\n<p>However, I want to be able to generate a <em>connected</em> network topology for \na specific number of nodes. Since Waxman\'s algorithm generates edges probabilistically, I usually end up with disconnected nodes. How do I connect the rest of the nodes to the topology in a way consistent with Waxman\'s algorithm, i.e. simulates a real network topology?</p>\n\n<p>There are plenty of ways to "finish" the topology by connecting the disconnected nodes, but I don\'t know which one is the most compatible with the already-generated edges. Waxman\'s paper doesn\'t seem to mention how disconnected nodes are treated.</p>\n', 'ViewCount': '140', 'Title': 'How to generate a connected random network topology for a specific number of nodes?', 'LastActivityDate': '2013-12-20T19:31:08.647', 'AnswerCount': '2', 'CommentCount': '1', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '11143', 'Tags': '<graphs><computer-networks>', 'CreationDate': '2013-11-03T04:13:49.333', 'FavoriteCount': '1', 'Id': '16664'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>So say we have a bipartite graph G=(X,Y,E). Let\'s make a game out of it.</p>\n\n<p>I go first. I pick a node in X. You go next. You pick a node in Y that is connected by an edge to the node I picked. Next it\'s my turn. I pick another node in X (must be a new one that hasn\'t been used before) that is also connected to the node in Y you just picked. We continue playing in this manner, until someone cannot pick a node (i.e. all edges out of the current node have already been used). When that happens, the person who cannot pick a next node loses.</p>\n\n<p>I\'m supposed to find a polynomial time algorithm to decide which of the two players (you or me) can force a "win" for a given bipartite graph.</p>\n\n<p>I\'m stumped. I\'ve approached this in many different ways, including the following two:</p>\n\n<p>1) 1) each node in the xy "path" played will use two edges, except for the first and last nodes which will only use one edge. Idea: add one new node on each side of the bipartite graph, and connect to all opposite nodes. Then check for a perfect (or maximal) matching twice, removing the edges used in the first perfect (maximal) matching when finding the second one. I don\'t think this really helps us with the problem, though, as there are many different nodes you could visit next given a current node.</p>\n\n<p>2) A second idea was to work with alternating/augmenting paths (as we "zig-zag" between the two sides). I again got stuck since at any given node there are many possible nodes to visit next.</p>\n\n<p>Does anyone have any suggestions for this problem? I\'m thinking it has to do with matching, but I could be wrong.</p>\n\n<p>Thanks in advance!</p>\n', 'ViewCount': '120', 'Title': 'Bipartite Graph Game', 'LastActivityDate': '2013-11-13T08:27:30.500', 'AnswerCount': '2', 'CommentCount': '1', 'AcceptedAnswerId': '17976', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '10680', 'Tags': '<graph-theory><graphs><combinatorics><computer-networks><bipartite-matching>', 'CreationDate': '2013-11-12T22:58:47.500', 'Id': '17974'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>This question is on a test review and I'm not really sure of the answer.</p>\n\n<p>TCP packets are being sent from a client to a server. The MMS is equal to 1460 bytes, and each TCP packet is sent with the maximum capacity. How many TCP packets can be sent before the sequence number field in the TCP header will wrap around?</p>\n\n<p>How much time in seconds will this take on a 1 Mbit/s link?</p>\n\n<p>How much time in seconds will this take on a 1Gbit/s link?</p>\n\n<p>Is there some sort of formula used to figure this out?</p>\n\n<p>Thanks!</p>\n", 'ViewCount': '140', 'Title': 'TCP sequence numbers', 'LastActivityDate': '2013-11-24T19:50:23.583', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '10625', 'Tags': '<computer-networks>', 'CreationDate': '2013-11-24T19:50:23.583', 'Id': '18308'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Some guy on the internet <a href="http://networkengineering.stackexchange.com/a/5133/296">recommends</a> using the same ntp server when it is required to troubleshoot asymmetric routes through ICMP, and it\'s somewhat important to have synchronised time between the two machines doing ICMP.</p>\n\n<p>Granularity of timestamps in ICMP is 1ms (unique per 24h period), assume packet roundtrip between the source and destination of at least 100ms, each way of at least 50ms, plus jitter.</p>\n\n<p>I find the recommendation of using the same ntp server unreasonable; for one, because it would seem that the likelihood of any given reliable ntp server, anywhere in the world, carrying correct time is much higher than the likelihood of transmitting said time through the internet over longer distances (plus with potential jitter and packet loss), e.g. a good collection of local servers is already the best you could do for the task at stake.</p>\n\n<p>Basically, my conjecture is that, should a single ntp server be shared, it won\'t necessarily be a good server for both hosts doing ICMP, and would not contribute to the clock between the two (and only two) machines being the most synchronised, compared to a good collection of local servers instead.</p>\n\n<p>What\'s the mathematical take on this?</p>\n', 'ViewCount': '45', 'Title': 'NTP: synchronisation of time between two machines for ICMP timestamping', 'LastActivityDate': '2013-11-24T20:59:38.447', 'AnswerCount': '0', 'CommentCount': '0', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '11551', 'Tags': '<algorithm-analysis><reference-request><optimization><computer-networks><synchronization>', 'CreationDate': '2013-11-24T20:59:38.447', 'Id': '18310'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': u'<p>The <a href="https://en.wikipedia.org/wiki/Internet_Control_Message_Protocol#Timestamp" rel="nofollow">ICMP timestamp</a> protocol is useful for determining which path — forward or reverse — is contributing to the jitter on the line.</p>\n\n<p>In an ideal world, all computers would have an excellent ntpd, and time accuracy of about 1ms (the granularity of ICMP timestamp) should not be a problem:</p>\n\n<pre><code>0       145.5   146 = 75 + 71\n1       142.7   142 = 72 + 70\n2       140.7   140 = 70 + 70\n3       146.7   146 = 76 + 70\n4       148.3   148 = 77 + 71\n5       157.5   157 = 87 + 70\n6       167.1   167 = 96 + 71\n7       166.3   166 = 95 + 71\n8       167.7   167 = 97 + 70\n9       159.0   159 = 88 + 71\n</code></pre>\n\n<p>However, in reality, as per <a href="http://stackoverflow.com/questions/20172028/awk-hping-print-difference-between-icmp-originate-receive/20186781#20186781">http://stackoverflow.com/questions/20172028/awk-hping-print-difference-between-icmp-originate-receive/20186781#20186781</a>, the data could be like this:</p>\n\n<pre><code>0       165.9   166 = -142113 + 142279\n1       160.2   160 = -142118 + 142278\n2       155.2   155 = -142122 + 142277\n3       156.5   156 = -142121 + 142277\n4       164.7   165 = -142112 + 142277\n5       164.4   164 = -142111 + 142275\n6       160.9   161 = -142114 + 142275\n7       158.1   158 = -142117 + 142275\n8       155.6   156 = -142119 + 142275\n9       143.0   143 = -142131 + 142274\n10      153.2   153 = -142120 + 142273\n11      157.1   157 = -142115 + 142272\n12      158.3   158 = -142114 + 142272\n13      148.6   149 = -142123 + 142272\n14      144.3   144 = -142127 + 142271\n15      145.3   145 = -142125 + 142270\n</code></pre>\n\n<p>Which still shows that only one path is responsible for the jitter, since only one value jumps up and down randomly, whereas the other one is decreasing monotonically (probably due to an actively-running ntpd, which is correcting the time as we ping).</p>\n\n<p>Another example could be less wrong-looking of the time not being synchronised, say:</p>\n\n<pre><code>0       165.9   166 = -113 + 279\n</code></pre>\n\n<p>Or, better yet:</p>\n\n<pre><code>0       165.9   166 = 7 + 159\n</code></pre>\n\n<p>Or, say, still wrong by some 10ms to 40ms, on a landline link from Alberta to Vogtland, but much less obvious:</p>\n\n<pre><code>0       165.9   166 = 59 + 107\n</code></pre>\n\n<p>How to make scientific sense of this data, for it to be easily presentable, and not blatantly wrong?</p>\n\n<p>Feel free to assume to have between 10 to 1000 measurement points, measured over a couple of seconds or minutes.</p>\n', 'ViewCount': '50', 'Title': 'How to present ping data from ICMP timestamp', 'LastActivityDate': '2013-11-28T06:12:49.997', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '11551', 'Tags': '<algorithms><reference-request><computer-networks><synchronization>', 'CreationDate': '2013-11-25T20:05:35.750', 'Id': '18332'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': u'<p>Consider an instance of TCP’s Additive Increase Multiplicative Decrease(AIMD) algorithm where the window size at the start of the slow start phase is 2 MSS and the threshold at the start of the first transmission is 8 MSS. Assume that a time out occurs during the fifth transmission. Find the congestion window size at the end of the tenth transmission.</p>\n\n<p>I am bit confuse in this concept.<br>\nWhat I know :  </p>\n\n<p>Slow start and congestion avoidance are different.<br>\nSlow start is used in conjunction with congestion avoidance.   </p>\n\n<p>Window size for 1st transmission = 2 MSS<br>\nWindow size for 2nd transmission = 4 MSS<br>\nWindow size for 3rd transmission = 8 MSS \nthreshold reached, increase linearly (according to AIMD)<br>\nWindow size for 4th transmission = ?? MSS \nWindow size for 5th transmission = ?? MSS<br>\ntime out occurs, resend 5th with window size reduced to half (according to AIMD)<br>\nWindow size for 5th transmission =  ??? MSS  </p>\n\n<p>What will be the Window size for 4th transmission ? 9 MSS or 10 MSS<br>\nIt means i want to ask you after threshold window size should increase linearly means it  should increase by 1 MSS or 2 MSS  ( 2 MSS is given in example ) ?  </p>\n\n<p>What will be window size for 5th transmission ? Will it be 1 MSS or 2 MSS ?   </p>\n\n<p>Please clear my concept. I am so confused. </p>\n', 'ViewCount': '143', 'Title': 'TCP congestion problem', 'LastActivityDate': '2013-12-31T21:28:37.747', 'AnswerCount': '2', 'CommentCount': '0', 'Score': '-1', 'PostTypeId': '1', 'OwnerUserId': '9343', 'Tags': '<computer-networks>', 'CreationDate': '2013-12-25T11:49:45.653', 'Id': '19274'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am searching the content of this topic but I am not sure what should be the content for this topic. This is relate to Computer Network.\nMy topic is <code>Physical layer services &amp; hardware protocols.</code></p>\n\n<p>What should be content for this topic.</p>\n', 'ViewCount': '50', 'ClosedDate': '2014-01-18T12:17:17.253', 'Title': 'Physical layer services & hardware protocols', 'LastActivityDate': '2014-01-18T10:37:11.477', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '12933', 'Tags': '<computer-networks>', 'CreationDate': '2014-01-18T04:46:19.773', 'Id': '19803'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<blockquote>\n  <p>The OSI model can be used for LAN and WAN networks, allowing the interconnection of [vendor] closed systems and it only informs what each layer have to do.</p>\n</blockquote>\n\n<p>Someone said that this phrase is false, because OSI (Open Systems Interconnection) model, "as the name says", only allows the connection of "open systems".</p>\n\n<p>So I\'m wondering if there is any vendor closed network that, nonetheless, can communicate with another network using as the middle man an OSI based network. As I see it, in the broad sense of the phrase, two closed systems don\'t need to be directly connected to be interconnected, they can use a middle man.</p>\n\n<p>Searching I only found about closed systems in the sense that they can\'t be freely joined.</p>\n\n<p>Is that phrase true or false?</p>\n', 'ViewCount': '27', 'Title': 'Closed network system that use OSI model to connect to another network?', 'LastEditorUserId': '13305', 'LastActivityDate': '2014-02-01T17:58:39.580', 'LastEditDate': '2014-02-01T17:58:39.580', 'AnswerCount': '0', 'CommentCount': '2', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '13305', 'Tags': '<computer-networks>', 'CreationDate': '2014-02-01T14:22:30.510', 'Id': '20187'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am preparing for my exams and was solving problems regarding <code>Sliding Window Protocol</code> and I came across these questions..</p>\n\n<blockquote>\n  <p>A 1000km long cable operates a 1MBPS. Propagation delay is 10 microsec/km. If frame size is 1kB, then how many bits are required for sequence number?<BR><BR>\n  A) 3 B) 4 C) 5 D) 6</p>\n</blockquote>\n\n<p>I got the ans as C option as follows,</p>\n\n<pre><code>propagation time is 10 microsec/km\nso, for 1000 km it is 10*1000 microsec, ie 10 milisec\nthen RTT will be 20 milisec \n\nin 10^3 milisec 8*10^6 bits\nso, in 20 milisec X bits;\n\nX = 20*(8*10^6)/10^3 = 160*10^3 bits\n\nnow, 1 frame is of size 1kB ie 8000 bits\nso total number of frames will be 20. this will be a window size.\n\nhence, to represent 20 frames uniquely we need 5 bits.\n</code></pre>\n\n<p>the ans was correct as per the answer key.. and then I came across this one.. </p>\n\n<blockquote>\n  <p>Frames of 1000 bits are sent over a 10^6 bps duplex link between two hosts. The propagation time is \n  25ms. Frames are to be transmitted into this link to maximally pack them in transit (within the link).</p>\n  \n  <p>What is the minimum number of bits (l) that will be required to represent the sequence numbers distinctly? \n  Assume that no time gap needs to be given between transmission of two frames. </p>\n  \n  <p>(A) l=2 (B) l=3 (C) l=4 (D) l=5 </p>\n</blockquote>\n\n<p>as per the earlier one I solved this one like follows,</p>\n\n<pre><code>propagation time is 25 ms\nthen RTT will be 50 ms \n\nin 10^3 ms 10^6 bits\nso, in 50 ms X bits;\n\nX = 50*(10^6)/10^3 = 50*10^3 bits\n\nnow, 1 frame is of size 1kb ie 1000 bits\nso total number of frames will be 50. this will be a window size.\n\nhence, to represent 50 frames uniquely we need 6 bits.\n</code></pre>\n\n<p>and 6 is not even in the option. Answer key is using same solution but taking propagation time not RTT. and their answer is 5 bits. I am totally confused, which one is correct?</p>\n', 'ViewCount': '133', 'Title': 'Sliding window protocol, calculation of sequence number bits', 'LastActivityDate': '2014-02-06T08:25:54.473', 'AnswerCount': '0', 'CommentCount': '0', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '12221', 'Tags': '<computer-networks>', 'CreationDate': '2014-02-05T17:01:04.357', 'Id': '21324'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am considering strategies to compare the performance of routers with buffers vs. their lower latency counterparts in a simple network setting (N clients communicating with each other randomly through a router). I know that buffered routers should ideally perform better when there are traffic bursts.</p>\n\n<p>My question is regarding my concern which is that I do not know what is a good strategy to pick scenarios and how could I convey that these models are relevant to common real world situations. So the question would be:</p>\n\n<ol>\n<li>How to pick scenarios that are similar to real world situations?</li>\n<li>How to convince that these scenarios are indeed relevant to real\nworld situations.</li>\n</ol>\n\n<p>My main concern is measuring the benefit of buffers vs. an improvement in RRT (lower latency) with varying levels of congestion. Also showing possible disadvantages where the amounts of congestion are overwhelming (buffer bloat) and possibly other patterns.</p>\n', 'ViewCount': '29', 'ClosedDate': '2014-04-01T22:04:17.640', 'Title': 'Buffering packets vs. low latency routing', 'LastEditorUserId': '14875', 'LastActivityDate': '2014-02-21T10:18:53.960', 'LastEditDate': '2014-02-21T10:18:53.960', 'AnswerCount': '0', 'CommentCount': '3', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '14875', 'Tags': '<computer-networks><empirical-research><routing>', 'CreationDate': '2014-02-20T09:28:32.287', 'Id': '21840'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I'm reading up on network scheduling algorithms such as RED, ARED and WRED but I'm still not completely sure why networks need scheduling and these algorithms are necessary. </p>\n\n<p>Thanks!</p>\n", 'ViewCount': '49', 'Title': 'Why do networks need scheduling?', 'LastEditorUserId': '15503', 'LastActivityDate': '2014-03-12T12:39:32.913', 'LastEditDate': '2014-03-12T12:39:32.913', 'AnswerCount': '0', 'CommentCount': '3', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '15503', 'Tags': '<computer-networks><scheduling>', 'CreationDate': '2014-03-12T10:35:07.107', 'FavoriteCount': '1', 'Id': '22537'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>What will happen if sequence number is not used in an ARQ protocol (e.g, Go-back-N, selective repeat)?</p>\n', 'ViewCount': '23', 'ClosedDate': '2014-04-02T16:34:43.273', 'Title': 'ARQ Protocols and sequence numbers', 'LastActivityDate': '2014-03-14T04:59:29.223', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '-1', 'PostTypeId': '1', 'OwnerUserId': '15652', 'Tags': '<efficiency><computer-networks>', 'CreationDate': '2014-03-13T16:41:38.160', 'Id': '22592'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>What is a known strategy to approach a situation where short bursts of data are being sent very often over a high bandwidth, high latency cable? I am aware of cubic but even that does not utilize a 10GBps cable in a short burst scenario.</p>\n\n<p>Lets say I have a distributed network where a single computer is sending tasks to many other computers. The computers then respond with a short answer 50-100KB. We need to receive these answers as quickly as possible.</p>\n\n<p>What are the consideration and do we determine the optimal initial congestion window size? </p>\n\n<p>Assumptions:</p>\n\n<ol>\n<li>Using TCP Cubic.</li>\n<li>Bursts are arrive with a Poisson distribution.</li>\n<li>Goal is to get the data as quickly as possible.</li>\n<li>Two scenarios, limited or vast buffer size.</li>\n</ol>\n', 'ViewCount': '23', 'Title': 'Picking an optimal initial congestion window size (high bw, high latency and short bursts)?', 'LastEditorUserId': '14875', 'LastActivityDate': '2014-04-23T13:15:33.887', 'LastEditDate': '2014-04-23T13:15:33.887', 'AnswerCount': '0', 'CommentCount': '2', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '14875', 'Tags': '<computer-networks><network-flow><communication-protocols>', 'CreationDate': '2014-03-18T19:07:01.763', 'Id': '22765'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I have a friend working in wireless communications research. He told me that we can transmit more than one symbol in a given slot using one frequency (of course we can decode them at the receiver).</p>\n\n<p>The technique as he said uses a new modulation scheme. Therefore if one transmitting node transmits to one receiving node over a wireless channel and using one antenna at each node, the technique can transmit two symbols at one slot over one frequency.</p>\n\n<p>I am not asking about this technique and I do not know whether it is correct or not but I want to know if one can do this or not? Is this even possible? Can the Shannon limit be broken? Can we prove the impossibility of such technique mathematically?</p>\n\n<p>Other thing I want to know, if this technique is correct what are the consequences? For example what would such technique imply for the famous open problem of the interference channel? </p>\n\n<p>Any suggestions please? Any reference is appreciated.  </p>\n', 'ViewCount': '148', 'ClosedDate': '2014-04-02T13:18:01.173', 'Title': 'Can we break the Shannon capacity?', 'LastActivityDate': '2014-03-24T17:49:47.007', 'AnswerCount': '1', 'CommentCount': '3', 'AcceptedAnswerId': '23014', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '15913', 'Tags': '<reference-request><computer-networks>', 'CreationDate': '2014-03-24T17:01:40.950', 'FavoriteCount': '1', 'Id': '23009'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I\'m studying Distributed Systems and synchronization and I didn\'t catch this solution of totally ordered multicast with Lamport timestamps. I read that it doesn\'t need ack to deliver a message to the application, but</p>\n\n<blockquote>\n  <p>"It is sufficient to multicast any other type of message, as long as that message has a timestamp larger than the received message. The condition for delivering a message m to the application, is that another message has been received from each other process with a large timestamp. This guarantees that there are no more messages underway with a lower timestamp."</p>\n</blockquote>\n\n<p>This is a definition from a book. I tried to apply this definition to an example but I guess that something is wrong.</p>\n\n<h3>Example.</h3>\n\n<blockquote>\n  <p>There are 4 processes and they multicast the following messages (second number in parentheses is timestamp) :<br>\n  P1 multi-casts (m11, 5);  (m12, 12); (m13, 14);<br>\n  P2 multi-casts (m21, 6); (m22, 14);<br>\n  P3 multi-casts (m31, 5); (m32, 7); (m33, 11);<br>\n  P4 multi-casts (m41, 8); (m42, 15); (m43, 19).</p>\n</blockquote>\n\n<p>Supposing that there are no acknoledgments, can I guess which messages can be delivered and which not? Based on definition, my guess is that only m11 and m31 can be delivered to the application, because all the other messages received will have a timestamp greater, but this seems very strange, and I think I didn\'t understand the delivery condition very well. I have an exam next week and in general I\'d like to understand this mechanism.</p>\n', 'ViewCount': '73', 'Title': 'totally ordered multicast with Lamport timestamp', 'LastEditorUserId': '16819', 'LastActivityDate': '2014-04-20T13:25:52.457', 'LastEditDate': '2014-04-20T13:25:52.457', 'AnswerCount': '0', 'CommentCount': '2', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '16819', 'Tags': '<distributed-systems><computer-networks><synchronization><communication-protocols><message-passing>', 'CreationDate': '2014-04-16T07:26:03.173', 'FavoriteCount': '1', 'Id': '23847'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Why does packet don\'t need trailer/footer while frame needs it?</p>\n\n<p>I am trying to understand networking concept regarding OSI &amp; TCP/IP layering. I have googled a bit and it says that the footer in data link layer pdu (frame) is needed as a mark of the end of the pdu.</p>\n\n<p>But why does packet data etc in the layers above it doesn\'t need footer to mark the end of the pdu as well?</p>\n\n<p><img src="http://i.stack.imgur.com/ndZjU.gif" alt="enter image description here"></p>\n', 'ViewCount': '18', 'Title': "Why does packet data don't need trailer/footer while frame needs it?", 'LastEditorUserId': '13022', 'LastActivityDate': '2014-04-21T07:28:28.700', 'LastEditDate': '2014-04-21T07:28:28.700', 'AnswerCount': '0', 'CommentCount': '0', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '16948', 'Tags': '<computer-networks><communication-protocols>', 'CreationDate': '2014-04-21T06:35:21.200', 'Id': '23976'}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>To me they describe the same attributes, is there a real difference or are they the same thing.</p>\n\n<p>Thanks in advance</p>\n', 'ViewCount': '13', 'ClosedDate': '2014-04-26T17:15:30.040', 'Title': 'Whats the difference between the MasterNode and the NameNode?', 'LastActivityDate': '2014-04-26T11:46:19.663', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '-1', 'PostTypeId': '1', 'OwnerUserId': '7173', 'Tags': '<computer-networks>', 'CreationDate': '2014-04-26T11:46:19.663', 'Id': '24126'}