362_0:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I am working on a diagram editor.\nDiagrams display 2D shapes (<em>nodes</em>) connected with connectors (<em>edges</em>).</p>\n\n<p>I\'d like to add an operation that, given a selection of nodes, <em>"disentangles"</em> them: it repositions them to reduce the number of crossing edges, if possible\n(and it\'s OK if the edges will have to be drawn with bend points).</p>\n\n<p>So I want a graph algorithm that, given a (<em>topological</em>) graph embedding and a subset of its nodes, modifies the embedding (its <em>topology</em>) on only those nodes so as to minimize the number of crossing edges.</p>\n\n<p>From reading <a href="https://en.wikipedia.org/wiki/Apex_graph#Characterization_and_recognition" rel="nofollow">about apex graphs</a> and browsing <a href="http://epubs.siam.org/doi/abs/10.1137/120872310" rel="nofollow">Cabello and Mohar (2013)</a>, I suppose this problem is NP-hard.\nSo I\'ll be happy with a parametrized algorithm (e.g. on the number of crossing edges) that has a known, polynomial, time complexity for any given parameter value. This seems feasible, but I don\'t find it easy to come up with such an algorithm on my own.</p>\n\n<p>Questions:</p>\n\n<ul>\n<li>Where do I look for such an algorithm?</li>\n<li>Does it exist?</li>\n<li>In existing software?</li>\n<li>Is there any significant practical experience with such an operation? (What looks good in theory may not be so good in practice, or vice versa.)</li>\n</ul>\n\n<p><em>(I am not sure where best to ask this question: here, on StackOverflow, or MathOverflow?)</em></p>\n', 'ViewCount': '236', 'Title': 'How to reduce the number of crossing edges in a diagram?', 'LastEditorUserId': '917', 'LastActivityDate': '2013-10-08T18:57:07.263', 'LastEditDate': '2013-10-08T10:00:56.180', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '917', 'Tags': '<graph-theory><graph-algorithms><crossing-number>', 'CreationDate': '2013-10-08T09:45:18.533', 'FavoriteCount': '1', 'Id': '14901'}