3780:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'ViewCount': '339', 'Title': 'How can Computer Science theories and inquiries be resolved?', 'LastEditDate': '2013-11-19T21:50:53.857', 'AnswerCount': '4', 'Score': '6', 'OwnerDisplayName': 'Carter Pape', 'PostTypeId': '1', 'OwnerUserId': '8097', 'FavoriteCount': '4', 'Body': u'<p>It\'s probably possible to prove that P ≠ NP, that one-way functions exist, and that parity games cannot be solved in polynomial time (yes, I\'ve been reading through <a href="http://en.wikipedia.org/wiki/List_of_unsolved_problems_in_computer_science">this list</a>), but how would we go about proving any of those things? Have there been any proofs to any computer science theories, or answers to any substantial computer science questions (such as the ones in <a href="http://en.wikipedia.org/wiki/List_of_unsolved_problems_in_computer_science">that list</a>)? Are they like mathematical proofs (such as Grigori Perelman\'s resolution to the Poincar\xe9 conjecture)? I know that the P versus NP problem seems out of my league, being a junior in high school, but it\'s a problem that intrigues me, and I would really like to see how others (if any) have answered other, related questions, because I would like to look into a resolution to the problem.</p>\n\n<p>This isn\'t a duplicate of <a href="http://physics.stackexchange.com/questions/31068/can-a-scientific-theory-ever-be-absolutely-proven">this question</a> primarily because physics isn\'t computer science, and secondarily because, unless I\'m mistaken, computer science theories are not proven the same way that theories related to physical sciences are proven. They\'re more like mathematical proofs in that they\'re logical (right?).</p>\n', 'Tags': '<epistemology>', 'LastEditorUserId': '39', 'LastActivityDate': '2013-11-19T21:50:53.857', 'CommentCount': '0', 'AcceptedAnswerId': '11911', 'CreationDate': '2013-05-09T00:15:12.400', 'Id': '11906'}