349_0:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I'm interested in learning about how facial recognition works.  I'm especially interested in the algorithms or approach that is used.  What are the leading methods for facial recognition?  Is there a good overview or source to learn about a few of the most widely used algorithms for facial recognition?  What would be the best handful of research papers to read first?</p>\n", 'ViewCount': '90', 'Title': 'How does facial recognition work?', 'LastEditorUserId': '98', 'LastActivityDate': '2013-09-02T10:59:55.660', 'LastEditDate': '2013-09-02T10:33:34.133', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '755', 'Tags': '<reference-request><computer-vision><pattern-recognition><facial-recognition>', 'CreationDate': '2013-09-02T04:54:02.340', 'Id': '14075'},349_1:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>Some humans can lip-read fairly well: by watching someone who is speaking, they can tell what the speaker is saying (even without hearing the speech).</p>\n\n<p>Has there been any work on building computer software to lip-read?  In other words, given a video of someone speaking, is it possible to build software to infer what the person is saying (with access only to the video stream, without audio)?  Has there been any research on this problem, or even deployed systems?</p>\n\n<p>Background and motivation: In the US, certain laws may forbid recording audio without consent.  However, there is generally no prohibition on recording video without consent of the people being recorded.  (That's why you see surveillance cameras all over the place, and why they record only video but never audio.)  I am curious whether technology has advanced enough that, solely from video, it might be possible for automated methods to tell what people are saying -- or whether that might become feasible in the near-future.  And, apart from the privacy implications, such a technology might be pretty useful.</p>\n", 'ViewCount': '117', 'Title': 'Automated lip-reading: inferring what someone is saying, based upon video of them speaking', 'LastEditorUserId': '98', 'LastActivityDate': '2013-09-02T10:57:04.990', 'LastEditDate': '2013-09-02T10:34:40.780', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '755', 'Tags': '<reference-request><computer-vision><pattern-recognition><facial-recognition>', 'CreationDate': '2013-09-02T05:05:58.230', 'Id': '14076'}