{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I am interested in exploring the world of <a href="http://en.wikipedia.org/wiki/BDI_software_agent" rel="nofollow">BDI agents</a> (software agents that possess "beliefs, desires, intentions", essentially the agent has knowledge of the world, a set of motivations, and carries out certain plans).</p>\n\n<p>I recently read A Canonical Agent Model for Healthcare Applications [1], which left me with a lot of questions, particularly about the specialization of different agent models for particular applications.  </p>\n\n<p>The particular modeling language used in their examples was ProForma, and I understand that this is more for the abstract specification of an agent, and that something like <a href="http://en.wikipedia.org/wiki/3APL" rel="nofollow">3APL</a> can be used as an actual programming language in this regard, with syntax like:</p>\n\n<pre><code>BELIEFBASE {\n    status(standby).\n    at(0,0).\n    location(r1,2,4).\n    location(r5,6,1).\n    dirty(r1).\n    dirty(r5).\n}\n</code></pre>\n\n<p>My question is, all of these systems clearly reflect years of cumulative efforts, and rather than jumping in to the deep end, I\'d like to ease into this world of research a bit more slowly.  Is there a canonical reference in this area that might be able to provide a more general overview of all of these levels of organization, and where the abstractions stop and the implementations begin?</p>\n\n<hr>\n\n<ol>\n<li>Fox J., Glasspool, D., Modgil, S. <a href="http://www.sdela.dds.nl/entityresearch/fox_glasspool_modgil.pdf" rel="nofollow">A Canonical Agent Model for Healthcare Applications</a>. <em>IEEE Intelligent Systems, 21</em>(6), 21-28, 2006.</li>\n</ol>\n', 'ViewCount': '60', 'Title': 'Canonical reference on agent-based computing', 'LastEditorUserId': '98', 'LastActivityDate': '2012-07-18T10:02:23.730', 'LastEditDate': '2012-07-18T10:02:23.730', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '2776', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '88', 'Tags': '<reference-request><human-computing><agent-based-computing>', 'CreationDate': '2012-07-16T13:59:10.390', 'Id': '2764'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>We know the halting problem (on Turing Machines) is undecidable for Turing Machines. Is there some research into how well the human mind can deal with this problem, possibly <em>aided</em> by Turing Machines or general purpose computers?</p>\n\n<p><em>Note</em>: Obviously, in the strictest sense, you can always say no, because there are Turing Machines so large they couldn't even be read in the life span of a single human. But this is a nonsensical restriction that doesn't contribute to the actual question. So to make things even, we'd have to assume humans with an arbitrary life span.</p>\n\n<p>So we could ask: Given a Turing Machine T represented in any suitable fashion, an arbitrarily long-lived human H and an arbitrary amount of buffer (i.e. paper + pens), can H decide whether T halts on the empty word?</p>\n\n<hr>\n\n<p><em>Corollary: If the answer is yes, wouldn't this also settle if any computer has a chance of passing the turing-test?</em></p>\n", 'ViewCount': '1255', 'Title': 'Human computing power: Can humans decide the halting problem on Turing Machines?', 'LastActivityDate': '2013-05-18T19:19:20.827', 'AnswerCount': '7', 'CommentCount': '10', 'Score': '21', 'PostTypeId': '1', 'OwnerUserId': '26', 'Tags': '<computability><turing-machines><halting-problem><human-computing>', 'CreationDate': '2012-08-21T10:46:52.483', 'FavoriteCount': '6', 'Id': '3271'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '156', 'Title': 'Which is the equivalent processing of human brain in terms of computer processing?', 'LastEditDate': '2014-01-28T08:23:06.760', 'AnswerCount': '2', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '12657', 'FavoriteCount': '1', 'Body': '<p>How many flops my brain can process, or how many GHz is a human brain capable of?\nIs it valid to think that each celular brain is like a small cpu? (like cuda architecture). Our brains works in parallel, right?</p>\n', 'Tags': '<terminology><human-computing><computer-vs-human>', 'LastEditorUserId': '98', 'LastActivityDate': '2014-01-28T11:46:18.233', 'CommentCount': '1', 'AcceptedAnswerId': '20031', 'CreationDate': '2014-01-27T20:04:40.527', 'Id': '20016'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>In a normal CAPTCHA scenario, a computer creates a challenge and a correct response to it.  (The challenge is an image of distorted text, for instance, and the response is the characters depicted.)  These are constructed so that hopefully a human can easily determine the response from the challenge, but a computer cannot.  Ordinarily only the originating computer, which already knows the correct response, can determine whether a given response was correct.</p>\n\n<p>My question: is it possible to create a CAPTCHA that computers can verify, but not solve?  In other words, is it possible to create a scenario that looks like this:</p>\n\n<p>Computer A generates a challenge, sends it to Human B and Computer C</p>\n\n<p>Computer C cannot feasibly determine the correct response, other than by brute-force search (which can hopefully be made impractical by the size of the response.)</p>\n\n<p>Human B can feasibly determine the correct response.  ("Feasibly" is not easy to define.  We need the response to be much bigger than normal CAPTCHAs in order to deter simple brute-force searching by computers, so "as easy as a normal CAPTCHA" is going to be impossible.  But it\'s not out of the realm of possibility to make a human type in a large response.  It\'d just be really annoying. A few hundred printable characters can get to 2048 bits, for instance.  So as a rough definition: it\'s allowed it to be annoying as hell, but it has to at least be feasible for a person.  Assume the person\'s physical and mental abilities are roughly average for a literate computer user.)</p>\n\n<p>If Human B sends Computer C the correct response, Computer C can feasibly verify that the response is correct, without contacting computer A or having any prior knowledge other than the challenge.</p>\n\n<p>Would it be possible, under today\'s technology and knowledge, to create such a protocol?</p>\n\n<p>Furthermore, would it be possible to design the protocol such that even Computer A can\'t determine the correct response to the challenge it just generated without human input--and Computer C can verify that Computer A could not have known the response without a human providing the solution?  If this all this can be achieved, then the result is analogous to the "proof of work" seen in bitcoin and other protocols.  Instead of a proof of computational work, we\'d have a proof of <em>human</em> work--the combination of the challenge and correct response would constitute proof that a human spent some marginal amount of effort.  This proof would then be verifiable by any computer.  Is such a thing even remotely plausible?</p>\n\n<p>Of course, at some point in the future computers will probably overtake humans altogether.  Once that happens, there will not be any problems that are feasible for a human but not a computer, and therefore no CAPTCHAs or CAPTCHA-like protocols will be possible.</p>\n\n<p>But what about under currently known human and computer abilities?</p>\n', 'ViewCount': '56', 'Title': 'Is there a way to create a "captcha"-like problem that computers can verify, but only humans can solve?', 'LastActivityDate': '2014-03-23T08:30:40.020', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '16017', 'Tags': '<computer-vs-human><human-computing>', 'CreationDate': '2014-03-23T07:43:13.560', 'FavoriteCount': '2', 'Id': '22966'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Ok before I start I realise this is on the fringe of on-topic (I have read the Questions help for this site), particularly as this is not a real-world problem. However:</p>\n\n<ol>\n<li>I cannot find anything relevant on Google</li>\n<li>From a purist point of view surely it must fall within Computer Science?</li>\n</ol>\n\n<p>In any case, if I have overstepped a boundary then I apologise and welcome the  Closure as I am an avid user of other SE sites so I understand the issues.</p>\n\n<p>Caveats aside, here it is:\nI have long wondered if it would be possible to build a functioning computing system, using humans as discrete logic components, to solve problems that individual humans could not solve in a practical timesscale. For example, imagine a number of humans stranded on an island without any machines, that needed to crunch some complex numbers to escape.</p>\n\n<p>I imagine arranging people so that they receive inputs from other groups within the system, make simple decisions (perhaps binary decisions, perhaps not) and pass the outputs to other groups.</p>\n\n<p>Then I imagine some kind of programming language could be developed to control the data and computation flow and the language could be used to solve complex problems without individuals understanding the overall problem.</p>\n\n<p>So I guess the above is not an answerable question- but <strong>does anyone know of any research, books, papers or whatever</strong> on what it would take to achieve, what kinds of of problems could be addressed and potentially solved, what kind of control language could be deployed and how the architecture could be scaled up to handled more complex problems?</p>\n\n<p>I suppose, in essence, I am looking for anything on "idealised" atomic (as in self contained) and standard computing units that could be arranged at will- I am just thinking in human terms.</p>\n\n<p>I find the idea fascinating and alluring. I\'d love to try it out one day and see what performance could be achieved! Sorry for the tags I have used, as I was searching the tags here I quickly became aware I have no idea of the correct terminology for what I am thinking, though I am sure it exists within the field...</p>\n', 'ViewCount': '1937', 'Title': 'Using humans as components to build a computer?', 'LastEditorUserId': '13022', 'LastActivityDate': '2014-03-27T08:10:19.003', 'LastEditDate': '2014-03-26T15:29:07.250', 'AnswerCount': '5', 'CommentCount': '13', 'Score': '12', 'PostTypeId': '1', 'OwnerUserId': '16151', 'Tags': '<reference-request><human-computing>', 'CreationDate': '2014-03-26T13:58:32.413', 'FavoriteCount': '4', 'Id': '23075'}},