560:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>In computer networking and high-performance cluster computer design, network topology refers to the design of the way in which nodes are connected by links to form a communication network. Common network topologies include the mesh, torus, ring, star, tree, etc. These topologies can be studied analytically to determine properties related to their expected performance; such characteristics include diameter (maximal distance between a pair of nodes, in terms of the number of links which must be crossed if such nodes communicate), the average distance between nodes (over all pairs of nodes in the network), and the bisection bandwidth (the worst-case bandwidth between two halves of the network). Naturally, other topologies and metrics exist.</p>\n\n<p>Consider a network topology based on the Koch snowflake. The simplest incarnation of such a topology consists of three nodes and three links in a fully-connected setup. The diameter is 1, average distance is 1 (or 2/3, if you include communications inside a node), etc.</p>\n\n<p>The next incarnation of the topology consists of 12 nodes and 15 links. There are three clusters of three nodes fully, each cluster being fully connected by three links. Additionally, there are the three original nodes, connecting the three clusters using six additional links.</p>\n\n<p>In fact, the number of nodes and links in incarnation $k$ are described by the following recurrence relations:\n$$N(1) = 3$$\n$$L(1) = 3$$\n$$N(k+1) = N(k) + 3L(k)$$\n$$L(k+1) = 5L(k)$$\nHopefully, the shape of this topology is clear; incarnation $k$ looks like the $k^{th}$ incarnation of the Koch snowflake. (A key difference is that for what I have in mind, I am actually keeping the link between the 1/3 and 2/3 nodes on successive iterations, so that each "triangle" is fully connected and the above recurrence relations hold).</p>\n\n<p>Now for the question:</p>\n\n<blockquote>\n  <p>Has this network topology been studied, and if so, what is it called? If it has been studied extensively, are there any references? If not, what are the diameter, average distance and bisection bandwidth of this topology? How do these compare to other kinds of topologies, in terms of cost (links) &amp; benefit?</p>\n</blockquote>\n\n<p>I have heard of a "star of stars" topology, which I think is similar, but not identical, to this. If anything, this seems to be more of a "ring of rings", or something along those lines. Naturally, tweaks could be made to the definition of this topology, and more advanced questions could be asked (for instance, we could assign different bandwidths to links introduced at earlier stages, or discuss scheduling or data placement for such a topology). More generally, I am also interested in any good references for exotic or little-studied network topologies (regardless of practicality). </p>\n\n<p>Again, apologies if this demonstrates ignorance of relevant research results, and any insights are appreciated.</p>\n', 'ViewCount': '148', 'Title': 'Analysis of and references for Koch-snowflake-like (and other exotic) network topologies', 'LastEditorUserId': '69', 'LastActivityDate': '2012-05-09T16:27:06.473', 'LastEditDate': '2012-03-09T16:24:00.603', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '8', 'PostTypeId': '1', 'OwnerUserId': '69', 'Tags': '<computer-networks><network-topology>', 'CreationDate': '2012-03-09T05:30:42.347', 'FavoriteCount': '1', 'Id': '149'},561:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>Fully connected (at least layer to layer with more than 2 hidden layers) backprop networks are universal learners. Unfortunately, they are often slow to learn and tend to over-fit or have awkward generalizations. </p>\n\n<p>From fooling around with these networks, I have observed that pruning some of the edges (so that their weight is zero and impossible to change) tends to make the networks learn faster and generalize better. Is there a reason for this? Is it only because of a decrease in the dimensionality of the weights search space, or is there a more subtle reason?</p>\n\n<p>Also, is the better generalization an artifact of the 'natural' problems I am looking at?</p>\n", 'ViewCount': '302', 'Title': 'Why do neural networks seem to perform better with restrictions placed on their topology?', 'LastEditorUserId': '31', 'LastActivityDate': '2012-03-18T04:38:07.220', 'LastEditDate': '2012-03-17T08:36:17.587', 'AnswerCount': '2', 'CommentCount': '0', 'Score': '22', 'PostTypeId': '1', 'OwnerUserId': '55', 'Tags': '<machine-learning><network-topology><neural-networks>', 'CreationDate': '2012-03-17T07:00:56.503', 'FavoriteCount': '3', 'Id': '455'},562:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>I\'m currently looking at network clustering algorithms (we\'re currently looking at both directed and undirected, unweighted networks).  The algorithms we\'ve tried produce visually nice clusters.  However, we would like to evaluate them against some "gold standard" -- a collection of networks in which the clusters have already been identified (and are more-or-less regarded as <em>the</em> clusters by the complex network\'s research community).</p>\n\n<blockquote>\n  <p><strong>Question</strong>: What are the gold standards for network clustering algorithms?  Where can I access them?</p>\n</blockquote>\n', 'ViewCount': '91', 'Title': 'Seeking "gold standard" to evaluate accuracy of network clustering algorithm', 'LastActivityDate': '2012-08-05T13:36:02.027', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '2254', 'Tags': '<algorithms><data-sets><network-topology>', 'CreationDate': '2012-08-03T03:24:45.980', 'Id': '3013'},563:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>In peer-to-peer (P2P) networks nodes are interconnected with each other. In client/server (C/S) networks clients talks to the server. If in a C/S network clients also want to talk with each other (such as in a multiplayer online game), then clients would have to communicate through the server.</p>\n\n<p>Given these, is it possible determine which architecture is more bandwidth consuming?</p>\n', 'ViewCount': '51', 'Title': 'P2P and C/S, is it possible to determine which one is more bandwidth consuming?', 'LastActivityDate': '2013-01-27T04:14:08.647', 'AnswerCount': '2', 'CommentCount': '0', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '5387', 'Tags': '<computer-networks><network-topology>', 'CreationDate': '2013-01-12T03:53:39.057', 'Id': '7895'}