{'Body': '<p>The <a href="http://en.wikipedia.org/wiki/Subsumption_architecture" rel="nofollow">subsumption architecture</a>, proposed by Rodney Brooks in 1986, is a "bottom-up" approach, in which robots are designed using simple hierarchical models.  These models build upon and subsume the lower modules to form a final product.  For example, a robot can be given a "find opening" module which is subsumed by a more abstract "find doorway" module, which is then itself subsumed by an "exit the playing field" module.</p>\n\n<p>Now, obviously, in a more "object-oriented" design, we could have started the design with the "exit the playing field module", but for sake of argument, assume some of the more primitive components (as "functions") will likely get reused in other higher concepts.</p>\n\n<p>Realizing that implementing this robot in a procedural language (or a functional one, for that matter) could be the simplest, but is it counterproductive to try to conceive of a subsumption architecture-based robot in an object-oriented programming paradigm? (realizing also that it\'s perhaps difficult to weigh a software engineering paradigm against a robotics one)  To obtain a solution, is there some form of "adapter" that can be implemented for increasing the effectiveness of using what may be two conflicting paradigms? </p>\n', 'ViewCount': '105', 'Title': 'Can bottom-up architectures be effectively programmed in top-down paradigms?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-08-07T08:22:06.383', 'LastEditDate': '2012-08-07T08:22:06.383', 'AnswerCount': '1', 'CommentCount': '4', 'AcceptedAnswerId': '2945', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '88', 'Tags': '<programming-languages><artificial-intelligence><algorithm-design><object-oriented>', 'CreationDate': '2012-07-28T05:25:40.627', 'Id': '2938''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'ViewCount': '255', 'Title': 'Why classes implicitly derive from only the Object Class?', 'LastEditDate': '2012-08-07T08:17:37.153', 'AnswerCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '2385', 'FavoriteCount': '2', 'Body': '<p>I do not have any argument opposing why we need only a single universal class. However why not we have two universal classes, say an Object and an AntiObject Class. In nature and in science we find the concept of duality - like Energy &amp; Dark Energy; Male &amp; Female; Plus &amp; Minus; Multiply &amp; Divide; Electrons &amp; Protons; Integration &amp; Derivation; and in set theory. There are so many examples of dualism that it is a philosophy in itself. In programming itself we see Anti-Patterns which helps us to perform work in contrast to how we use Design patterns. I am not sure, but the usefulness of this duality concept may lie in creating garbage collectors that create AntiObjects that combine with free or loose Objects to destruct themselves, thereby releasing memory. Or may be AntiObjects work along with Objects to create a self-modifying programming language - that allows us to create a safe self modifying code, do evolutionary computing using genetic programming, do hiding of code to prevent reverse engineering. </p>\n\n<p>We call it object-oriented programming. Is that a limiting factor or is there something fundamental I am missing in understanding the formation of programming languages?</p>\n', 'Tags': '<programming-languages><type-theory><object-oriented>', 'LastEditorUserId': '98', 'LastActivityDate': '2014-04-19T21:14:54.720', 'CommentCount': '8', 'AcceptedAnswerId': '3068', 'CreationDate': '2012-08-07T07:38:44.630', 'Id': '3067''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': u'<p>I am looking for references and papers on the following topic.</p>\n\n<ol>\n<li><p>In <em>general</em>, some programming languages allow dynamic changes to classes. As an example, a new instance variable ‘weight’ can be added to the class <code>Edge</code> (the class of unweighted edges of graphs). But what should happen with existing edge objects?</p>\n\n<p>They can be upgraded to include the new instance variable with a default value, perhaps weight <code>0</code>, in the edge example. Or existing objects stay the same.</p></li>\n<li><p>In <em>context-oriented</em> programming, similar situations can arise, when a context is dynamically activated at run-time. This may affect changes to methods which are currently executed (although I am concerned at the single thread execution at the moment).</p></li>\n<li><p>Considering <em>design patterns</em>, when a proxy object wraps another object, references to the old object may expect certain invariants that the proxy object doesn’t adhere to. This may also lead to inconsistencies when an object is wrapped/’updated’ with a proxy object.</p></li>\n</ol>\n\n<p>Are there any references that list possible ways to treat the problem in case of dynamic changes/activation? Like the options to keep the state consistent?</p>\n\n<p>I looked primarily in the communities of dynamic software evolution, context-oriented programming and software components. Are there other important communities I can search to find references?</p>\n', 'ViewCount': '35', 'Title': 'Dynamic changes to classes or context activation -- how to treat existing objects in a consistent way?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-08-14T01:18:12.753', 'LastEditDate': '2012-08-13T23:35:19.433', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '3165', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<reference-request><programming-languages><semantics><object-oriented>', 'CreationDate': '2012-08-13T22:06:34.507', 'Id': '3156''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I am converting the OCaml <a href="http://caml.inria.fr/pub/docs/manual-ocaml/libref/Format.html" rel="nofollow">Format</a> module which does I/O and maintains state in a record with mutable values. As such it is a good candidate for me to convert to pure <a href="http://en.wikipedia.org/wiki/F_Sharp_%28programming_language%29" rel="nofollow">F#</a>, pure <a href="http://en.wikipedia.org/wiki/C_Sharp_%28programming_language%29" rel="nofollow">C#</a> and a hybrid.</p>\n\n<p>Since this is a toss-up for me on the three versions, I am interested to know of any research papers that indicate that programmers may be moving to hybrid code of object-oriented and functional, calling one from the other, or staying with-in one programming family.</p>\n\n<p>Note: I am asking for research papers not subjective answers.</p>\n', 'ViewCount': '68', 'Title': 'Is there any research to indicate programmers are/are not moving to a hybrid of functional and object-oriented?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-09-15T14:14:19.027', 'LastEditDate': '2012-09-15T14:14:19.027', 'AnswerCount': '0', 'CommentCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '268', 'Tags': '<reference-request><programming-languages><functional-programming><object-oriented>', 'CreationDate': '2012-09-14T21:02:04.073', 'FavoriteCount': '1', 'Id': '3550''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': "<h2>Context</h2>\n\n<p>I've been programming in java for a few years now. And atm i'm learning something totally different: Clojure.\nThere the expression problem can be solved by using multimethods whereas in java you will need something like the visitor pattern or something alike.</p>\n\n<h2>The question</h2>\n\n<p>I've been reading about multimethods and got quite confused with the actual difference with method overloading.</p>\n\n<p>The only difference I spotted so far that a multimethod doesn't depend on the runtime type of the object on which the method is called.</p>\n", 'ViewCount': '252', 'Title': 'Difference between multimethods and overloading', 'LastEditorUserId': '39', 'LastActivityDate': '2012-09-22T08:57:09.780', 'LastEditDate': '2012-09-21T22:02:19.697', 'AnswerCount': '2', 'CommentCount': '1', 'AcceptedAnswerId': '4661', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '1700', 'Tags': '<programming-languages><semantics><functional-programming><object-oriented>', 'CreationDate': '2012-09-21T19:49:37.353', 'Id': '4660''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I need a concise definition of the "state of an object" in object-oriented programming (for a paper).</p>\n\n<p>For about half of a day I searched for a paper that I can cite on this topic, but I couldn\'t find one. All the papers I found were mostly general papers on object-oriented programming and they didn\'t define the state of an object.</p>\n\n<p>I am unsure, but my best guess is something like:\n<em>The state of an object is defined by the state of the instance variables of the object.</em></p>\n\n<p>I am searching for a definition of the state of an object and/or a reference on the topic.</p>\n\n<p>(btw, could I refer to the concept as "object state" or is this uncommon?)</p>\n', 'ViewCount': '1884', 'Title': 'Definition of the state of an object in OOP', 'LastEditorUserId': '1829', 'LastActivityDate': '2014-04-27T19:38:08.067', 'LastEditDate': '2012-11-07T16:03:17.703', 'AnswerCount': '3', 'CommentCount': '0', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<terminology><reference-request><programming-languages><object-oriented>', 'CreationDate': '2012-11-07T14:07:34.027', 'Id': '6536''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I have a question about inheritance in Java-like OO programming languages. It came up\nin my compiler class, when I explained how to compile methods and their invocation. I was using Java as example source language to compile. </p>\n\n<p>Now consider this Java program.</p>\n\n<pre><code>class A {\n  public int x = 0;\n  void f () { System.out.println ( "A:f" ); } }\n\nclass B extends A {\n  public int x = 1;\n  void f () { System.out.println ( "B:f" ); } }\n\npublic class Main {\n  public static void main ( String [] args ) {\n    A a = new A ();\n    B b = new B ();\n    A ab = new B ();\n\n    a.f();\n    b.f();\n    ab.f();\n    System.out.println ( a.x );\n    System.out.println ( b.x );\n    System.out.println ( ab.x ); } }\n</code></pre>\n\n<p>When you run it, you get the following result.</p>\n\n<pre><code>A:f\nB:f\nB:f\n0\n1 \n0\n</code></pre>\n\n<p>The interesting cases are those that happen with the object <code>ab</code> of\nstatic type <code>A</code>, which is <code>B</code> dynamically. As <code>ab.f()</code> prints out</p>\n\n<pre><code>B:f\n</code></pre>\n\n<p>it follows that method invocations are not affected by the compile-time type of the object the method is invoked with.  But\n<code>System.out.println ( ab.x )</code> prints out <code>0</code>, so member access is affected by compile-time types. </p>\n\n<p>A student asked about this difference: should not the access of members and methods be\nconsistent with each other?\nI could not come up with a better answer than "that\'s the semantics of Java".</p>\n\n<p>Would you know a crisp <em>conceptual</em> reason why members and methods are\ndifferent in this sense? Something I could give my students?</p>\n\n<p><strong>Edit</strong>: Upon further investigation, this seems to be a Java idiosyncrasy: C++ and C# act differently, see e.g. Saeed Amiri\'s comment below.</p>\n\n<p><strong>Edit 2</strong>: I just tried out the corresponding Scala program:</p>\n\n<pre><code>class A {\n  val x = 0;\n  def f () : Unit = { System.out.println ( "A:f" ); } }\n\nclass B extends A {\n  override val x = 1;\n  override def f () : Unit = { System.out.println ( "B:f" ); } }\n\nobject Main {\n  def main ( args : Array [ String ] ) = {\n    var a : A = new A ();\n    var b : B = new B ();\n    var ab : A = new B ();\n    a.f();\n    b.f();\n    ab.f();\n    System.out.println ( "a.x = " + a.x );\n    System.out.println ( "b.x = " + b.x );\n    System.out.println ( "ab.x = " + ab.x ); } }\n</code></pre>\n\n<p>And to my surprise this results in</p>\n\n<pre><code>A:f\nB:f\nB:f\na.x = 0\nb.x = 1\nab.x = 1\n</code></pre>\n\n<p>Note that the <code>overrise</code> modifiers are necessary. This surprises me because Scala compiles to the JVM, and moreover, when I compile and execute the Java program at the top using the Scala compiler/runtime, it behaves like the Java program. </p>\n', 'ViewCount': '270', 'Title': 'Inheritance, and dynamic access to members/attributes and methods in Java-like languages', 'LastEditorUserId': '39', 'LastActivityDate': '2014-03-24T13:58:31.023', 'LastEditDate': '2014-03-24T13:58:31.023', 'AnswerCount': '3', 'CommentCount': '5', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '2887', 'Tags': '<programming-languages><semantics><typing><object-oriented><java>', 'CreationDate': '2012-11-20T13:08:40.163', 'FavoriteCount': '1', 'Id': '6782''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I am looking for some sort of temporal logic for expressing invariants in interfaces. Since interfaces do not specify data representation, the invariants must rely solely on the publicly available functions of the interface.</p>\n\n<p>For example, suppose we have a simple interface (Java style) Sum:</p>\n\n<pre><code>interface Sum {\n    public void add (int a);\n    public int getSum();\n}\n</code></pre>\n\n<p>I want to express in an invariant that <code>getSum</code> returns the summation of <code>a</code> in all calls to <code>add(a)</code>, without using any data representation of this sum.</p>\n\n<p>The only way I can think of doing this is by using some form of temporal logic. Is there any literature on this subject available I can read? Any pointers would be much appreciated.</p>\n', 'ViewCount': '46', 'Title': 'Temporal logic for interface invariants', 'LastEditorUserId': '98', 'LastActivityDate': '2013-04-14T02:59:49.377', 'LastEditDate': '2013-04-12T07:15:00.573', 'AnswerCount': '2', 'CommentCount': '6', 'AcceptedAnswerId': '11298', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '7690', 'Tags': '<logic><object-oriented><linear-temporal-logic><software-verification>', 'CreationDate': '2013-04-12T00:18:07.817', 'Id': '11247''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I have usually been using the Cormen algorithm format to teach some introductory courses in Programming. I mean something like this:</p>\n\n<pre><code>TreeSearch(k,n)\n1. if x==NIL or k==x.key\n2.     return x\n3. if k&lt;x.key\n4.     return TreeSearch(k.left,n)\n5. else return TreeSearch(k.right,n)\n</code></pre>\n\n<p>Actually I have not agree with a couple of lecturers in my institution that they insist to put the type of the variable that they are using in the algorithm. I mean, to do that, will it not be to make a bias toward the programming language and not to focus on the algorithm? For example what would happen if the student grab other programming language, like R or Python, that really do not care about the type of variable.</p>\n\n<p>The other issue that I have is how to represent OOP algorithms in a nice algorithmic way. For example when I make a constructor should I put something like:</p>\n\n<pre><code>Class: car\nAttributes: wheels\nConstructor car()\n</code></pre>\n\n<p>or something like</p>\n\n<pre><code>Class: car\nFunction car()\n</code></pre>\n\n<p>also when I come to the part of inheritance, one of my colleages put the word super() to define inheritance in an algorithmic way, but again I think that is too Java-way to do this part. Usually they teach in that way because the practical part is made in Java, but again I think that the algorithm should be more freely, directly towards the logic, and not to an specific programming language.</p>\n\n<p>Does anybody knows some standard to represent algorithms for OOP?</p>\n', 'ViewCount': '213', 'Title': 'How to represent OOP concepts in algorithms in a standard way?', 'LastEditorUserId': '98', 'LastActivityDate': '2013-04-29T18:27:24.440', 'LastEditDate': '2013-04-29T18:27:24.440', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '6430', 'Tags': '<algorithms><terminology><education><object-oriented><didactics>', 'CreationDate': '2013-04-29T13:30:18.693', 'Id': '11658''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>Below, is the mapping of class diagram to object diagram correct? i cant seem to find a useful tutorial on object diagrams anywhere! </p>\n\n<p><img src="http://i.stack.imgur.com/qG5Wa.png" alt="enter image description here"></p>\n\n<p>Thanks in advance!</p>\n', 'ViewCount': '90', 'Title': 'Extracting an object diagram to a class diagram', 'LastEditorUserId': '7492', 'LastActivityDate': '2013-05-12T23:17:15.297', 'LastEditDate': '2013-05-12T23:17:15.297', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '8054', 'Tags': '<software-engineering><object-oriented>', 'CreationDate': '2013-05-12T14:25:41.470', 'Id': '11970''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': u'<p><strong>Introduction</strong><br>\nFor a paper I need contracts, which are also referred to as Design by Contract (DbC)<a href="http://www.eclipse.org/forums/index.php?t=thread&amp;frm_id=157" rel="nofollow">1</a>, and conceptually go back to Hoare[2]. For my work I need to apply contracts to Java bytecode. The question is only about using contracts on Java bytecode, nothing more.</p>\n\n<p>If you ask, why do you want to use contracts on Java bytecode, there is a reason. The reason is that I use a Java extension. This Java extension takes source code consisting of extended Java code, from which it generates bytecode. I want to use this Java extension and additionally I want to use contracts. The extension doesn\'t support contracts. So I have my extended Java code, I apply to it the compiler of the Java extension and I get Java bytecode. On this resulting bytecode I want to apply contracts. </p>\n\n<p>The Java extension is called Object Teams[4], also called eclipse object teams. The Java extension allows to use dynamic collaborations and aspects, which are not part of regular Java code. </p>\n\n<p>Right now I only need a hack or workaround to get one or two small examples working.</p>\n\n<p><strong>My idea so far:</strong><br>\nThis is irrelevant to the question. But it shows that my current plan is cumbersome and I need a better solution (thus the question). Also, perhaps someone has worked with JML/OpenJML and might know how to do this plan but better. </p>\n\n<p>There is a tool for contracts for Java language. The tool is called java modeling language(JML)[3][5]. The tool does not support contract for Java bytecode. The tool only supports contracts on Java source code. I want to rewrite part of the tool to support contracts on java bytecode (a solution to my question but a cumbersome one).</p>\n\n<p>Currently there is only one working version of the java modeling language(JML), which is called OpenJML[6]. I plan to use OpenJML on Java bytecode (remember, OpenJML doesn\'t support contracts for bytecode, only contracts for Java source code). I don\'t want to use contracts on any bytecode. I want to use contract on bytecode that is generated by a Java extension. (The Java extension is called ObjectTeams, but this is irrelevant for the question).</p>\n\n<p>(Annotations mean annotations that are part of the Java language, e.g., "@Overrides".)</p>\n\n<p>The approach would be to search for specific annotations in the bytecode that is generated by a Java extension. Those specific annotations specify contracts. I have to look for the specific annotations in the bytecode (bytecode that is generated by a Java extension), compile them to Java guard expressions, i.e., code that throws an exception if the contracts are not honored. I can get the compiled Java guard expression by using the library behind OpenJML. Then I need to add the byte code of the Java guard expression at the place where I found the specific annotations that represent contracts. </p>\n\n<p><strong>My question:</strong><br>\nUsing OpenJML seems possible, but difficult to achieve. Right now I just need a solution that works for one or two small examples, so the solution can be a hack or just a temporary solution. As my approach via OpenJML is probably difficult to achieve and further will take quite some time, I look for different solutions.</p>\n\n<p><strong>Question:</strong> <em>What options would you recommend to apply contracts (design by contract) for java bytecode?</em></p>\n\n<p>Requirements:  </p>\n\n<ol>\n<li>a up to date tool or library (i.e., not a project where development\nhas ceased or stopped three years ago)</li>\n<li>ideally, it should be straightforward to use the tool or library\n(i.e., not a project with zero or almost no documentation)</li>\n</ol>\n\n<h2>--</h2>\n\n<hr>\n\n<p><em><strong>Update / Clarification:</em></strong>  </p>\n\n<ul>\n<li>I forgot to mention that don\'t need any form of static checking. I<br>\nonly need to check  that the contracts hold during run time. Further\nI only need to use very basic contracts (pre- and postcondition,<br>\ninvariants) applied to only a few methods of my program.</li>\n<li>As Dave as pointed out in the comments, there may be another option\nto apply contracts together with Object Teams. This would mean\nmodifying or extending Object Teams and the CoreJDT module of Object\nTeams (it\'s in the comments).</li>\n<li>I also got <a href="http://www.eclipse.org/forums/index.php?t=thread&amp;frm_id=157" rel="nofollow">a reply from the creator of Object Teams</a> that using JML and Object Teams together via JDT isn\'t an easy fix.</li>\n</ul>\n\n<p>References:</p>\n\n<p><a href="http://www.eclipse.org/forums/index.php?t=thread&amp;frm_id=157" rel="nofollow">1</a> B. Meyer. Applying Design by Contract. Computer, 25(10):40{51, 1992.</p>\n\n<p>[2] C. A. R. Hoare. Proof of correctness of data representations. Acta Informatica, 1(4):271–81, 1972.</p>\n\n<p>[3] Lilian Burdy, Yoonsik Cheon, David R. Cok, Michael Ernst, Joseph R.Kiniry, Gary T. Leavens, K. Rustan M. Leino, and Erik Poll. An overviewof JML tools and applications. International Journal on Software Tools for Technology Transfer (STTT), 7(3):212–232, 2005.</p>\n\n<p>[4] <a href="http://www.eclipse.org/objectteams/" rel="nofollow">http://www.eclipse.org/objectteams/</a> </p>\n\n<p>[5] <a href="http://www.eecs.ucf.edu/~leavens/JML//index.shtml" rel="nofollow">http://www.eecs.ucf.edu/~leavens/JML//index.shtml</a> </p>\n\n<p>[6] <a href="http://jmlspecs.sourceforge.net/" rel="nofollow">http://jmlspecs.sourceforge.net/</a></p>\n', 'ViewCount': '101', 'Title': 'Contracts for Java Bytecode', 'LastEditorUserId': '1829', 'LastActivityDate': '2013-07-07T21:46:18.590', 'LastEditDate': '2013-07-07T18:12:30.883', 'AnswerCount': '1', 'CommentCount': '7', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<programming-languages><formal-methods><object-oriented><java>', 'CreationDate': '2013-07-07T03:32:32.007', 'FavoriteCount': '1', 'Id': '13121''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'ViewCount': '104', 'Title': '"OOD allows ADTs to be created and used."', 'LastEditDate': '2013-07-30T10:22:35.197', 'AnswerCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '9416', 'FavoriteCount': '1', 'Body': '<p>I just had a CS mid-term and one of the questions was:</p>\n\n<blockquote>\n  <p>OOD allows ADTs to be created and used.</p>\n  \n  <ul>\n  <li>True</li>\n  <li>False</li>\n  </ul>\n</blockquote>\n\n<p>I answered false, but my answer was marked as incorrect. I suspect what the question means is "objected-oriented design can be used to implement abstract data types", but if that\'s what it means it seems very clumsily worded to me. My rationale for answering false was ADTs are conceptual and exist outside of any particular programming paradigm, so "creation" of an ADT is purely a theoretical exercise.</p>\n\n<p>To me it seems like the question is analogous to saying "OOD allows algorithms to be created". You might use OOD in the implementation of an algorithm, but it has nothing to do with its creation.</p>\n\n<p>Would I be right in appealing my mark? My professor is kind of an idiot and I\'ve already corrected him on several other points throughout the term, so I\'m trying to avoid antagonizing him if I\'m wrong.</p>\n', 'Tags': '<programming-languages><object-oriented><abstract-data-types>', 'LastEditorUserId': '98', 'LastActivityDate': '2013-07-30T10:22:35.197', 'CommentCount': '1', 'AcceptedAnswerId': '13505', 'CreationDate': '2013-07-29T23:22:03.170', 'Id': '13503''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I have read the following artice that defines the term "constructor anomaly":</p>\n\n<p>Cohen, Tal, and Joseph Gil. "Better Construction with Factories." journal of object technology 6.6 (2007): 103-123.\n<a href="http://www.jot.fm/issues/issue_2007_07/article3/" rel="nofollow">http://www.jot.fm/issues/issue_2007_07/article3/</a></p>\n\n<p>Where can I find examples and references on constructor anomalies? (also in the context of multiplie inheritance)</p>\n\n<p>Are constructor anomalies always due to a method call in the constructor or is it possiple to construct an example without method calls in the constructor?</p>\n', 'ViewCount': '120', 'Title': 'OOP: exampe and references on constructor anomalies', 'LastActivityDate': '2013-10-28T18:00:12.867', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '16511', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<reference-request><programming-languages><object-oriented>', 'CreationDate': '2013-10-28T15:17:39.973', 'FavoriteCount': '1', 'Id': '16503''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I am talking about a measurement plan for software metrics and I am looking for references.</p>\n\n<p>In emperical software engineering there are code level measurements ("software metrics" that measure, e.g., some property like a paprameter for the redundancy of the code and possibly also a parameter of coupling and cohesion of a large software system.</p>\n\n<p>I have a finished paper with software measurements, but the feedback to me was that the way the measurements parameters are derive can be more, say "systematic" or better put in relationship with the research goals. I am interested to improve my approach for my "future work" (My English is not native, so perhaps I don\'t use the right terms.)</p>\n\n<p>Are there references on a "measurement plan for software metric" that helps to systematically derive measurement parameters from research goals? (Similar to the <a href="http://en.wikipedia.org/wiki/GQM" rel="nofollow">goal question metric</a> but more focused at academia?) I would like to</p>\n', 'ViewCount': '35', 'Title': 'Code measurements in emperical software engineering: how to plan measurements?', 'LastEditorUserId': '1829', 'LastActivityDate': '2013-12-12T19:02:33.633', 'LastEditDate': '2013-12-12T19:02:33.633', 'AnswerCount': '0', 'CommentCount': '2', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<reference-request><object-oriented>', 'CreationDate': '2013-12-12T15:52:42.563', 'FavoriteCount': '1', 'Id': '18926''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>Functional programming has the very elegant Lambda Calculus and its variants as a backup theory. Is there such a thing for OOP? What is an abstraction for the object oriented model?</p>\n', 'ViewCount': '142', 'Title': 'Is there a theory/abstraction behind OOP?', 'LastEditorUserId': '31', 'LastActivityDate': '2013-12-15T15:43:22.080', 'LastEditDate': '2013-12-15T15:43:22.080', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '11547', 'Tags': '<terminology><lambda-calculus><functional-programming><object-oriented>', 'CreationDate': '2013-12-13T20:43:26.677', 'Id': '18963''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': "<p>Way back in the day I took a course on discrete structures and learned about how the mathematical notion of an algebra is akin to the class data type. </p>\n\n<p>But I didn't know enough at the time to ask whether algebras are used to model classes or whether classes are actually derived from algebras (historically, technically...in whatever sense of 'derived' you like). </p>\n\n<p>Wikipedia and Google weren't much help. Anyone have any idea? </p>\n", 'ViewCount': '50', 'Title': 'Classes and Algebras: Which begat which?', 'LastActivityDate': '2014-02-06T16:31:45.933', 'AnswerCount': '2', 'CommentCount': '0', 'AcceptedAnswerId': '19644', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '11274', 'Tags': '<object-oriented>', 'CreationDate': '2014-01-10T21:11:19.393', 'Id': '19636''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>When I started to learn about imperative programming and declarative programming it raised many doubts, like, how are structured, modular and object-oriented programming classified: declarative or imperative?</p>\n', 'ViewCount': '41', 'ClosedDate': '2014-02-25T11:37:25.930', 'Title': 'How are programming paradigms classified?', 'LastEditorUserId': '31', 'LastActivityDate': '2014-02-25T05:40:51.600', 'LastEditDate': '2014-02-25T05:40:51.600', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '14998', 'Tags': '<programming-languages><object-oriented><programming-paradigms>', 'CreationDate': '2014-02-24T19:26:47.200', 'Id': '21998''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I have studied the book <a href="http://www.amazon.in/C-Demystified-Jeff-Kent/dp/0072253703" rel="nofollow">"C++ Demystified"</a>. Now I have started to read <a href="http://rads.stackoverflow.com/amzn/click/1878739069" rel="nofollow"><em>"Object-Oriented Programming in Turbo C++ first edition (1st edition)"</em></a> by Robert Lafore. I do not have any knowledge of programming which is beyond these books. This book might be outdated because it\'s 20 years old. I do have the latest edition, I am using the old because I like it, mainly I am just studying the basic concepts of OOP used in C++ through the first edition of Lafore\'s book.  </p>\n\n<p>Lafore\'s book emphasizes that "OOP" is only useful for <em>larger</em> and <em>complex</em> programs. It is said in every OOP book (also in Lafore\'s book) that procedural paradigm is prone to errors e.g. the global data as easily vulnerable by the functions. It is said that programmer can make <em>honest</em> errors in procedural languages e.g. by making a function that accidentally corrupts the data.    </p>\n\n<p>Honestly speaking I am posting my question because I am not grasping the explaination given in this book: <a href="http://rads.stackoverflow.com/amzn/click/0672323087" rel="nofollow">Object-Oriented Programming in C++ (4th Edition)</a> I am not grasping these statements written in Lafore\'s book:</p>\n\n<blockquote>\n  <p>Object-oriented programming was developed because limitations were discovered in\n  earlier approaches to programming....\n  As programs grow ever larger and more complex, even the structured programming approach begins to show signs of strain... \n  ....Analyzing the reasons for these failures reveals that there are weaknesses in the procedural paradigm itself. No matter how well the structured programming approach is implemented, large programs become excessively complex....\n  ...There are two related problems. First, functions have unrestricted access to global data. Second, unrelated functions\n  and data, the basis of the procedural paradigm, provide a poor model of the real world...</p>\n</blockquote>\n\n<p>I have studied the book "dysmystified C++" by Jeff Kent, I like this book very much, in this book mostly procedural programming is explained. I do not understand why procedural(structured) programming is weak!</p>\n\n<p>Lafore\'s book explains the concept very nicely with some good examples. Also I have grasped an intuition by reading Lafore\'s book that OOP is better than procedural programming but I am curious to know how exactly in practice procedural programming is weaker than OOP.</p>\n\n<p>I want to see myself what are the practical problems that one would face in procedural programming, how the OOP will make the programming easier. I think I will got my answer just by reading Lafore\'s book contemplatively but I want to see with my own eyes the problems in the procedural code, I want to see how the OOP style code of a program removes the foregoing errors that would happen if the same program were to be written using procedural paradigm.</p>\n\n<p>There are many features of OOP and I understand it is not possible for someone to explain me how all these features removes the foregoing errors that would generate by writing the code in procedural style.</p>\n\n<p>So, here is my question:</p>\n\n<blockquote>\n  <p>Which limitations of procedural programming does OOP address and how does it effectively remove these limitations in practice?</p>\n</blockquote>\n\n<p>In particular, are there examples for programs which are hard to design using the procedural paradigm but are easily designed using OOP?</p>\n', 'ViewCount': '219', 'Title': 'What problems of procedural programming does OOP solve in practice?', 'LastEditorUserId': '98', 'LastActivityDate': '2014-03-28T04:02:51.607', 'LastEditDate': '2014-03-25T08:30:22.733', 'AnswerCount': '6', 'CommentCount': '5', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '11633', 'Tags': '<object-oriented><programming-paradigms><procedural-programming>', 'CreationDate': '2014-03-20T14:47:25.803', 'FavoriteCount': '2', 'Id': '22867''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>I have been using C for a while, for some reasons I learnt C++. </p>\n\n<p>I can\'t see why object oriented is a "new" feature. For me an object is just a structure, and a set of functions which have a pointer to this structure as a parameter(the this parameter). So instead of creating structures then functions that modify them, the compiler gives you a direct way to do it.\nAlso for Late Binding, I see it as the same as if you had a hidden member in the structure to a function pointer. So again, nothing new in itself.</p>\n\n<p>So is OO just a compiler feature to make imperative easier by automating some things ?</p>\n', 'ViewCount': '24', 'ClosedDate': '2014-04-22T10:47:06.527', 'Title': 'Is object oriented programming fundamentally different than imperative programming?', 'LastEditorUserId': '98', 'LastActivityDate': '2014-04-22T10:46:28.613', 'LastEditDate': '2014-04-22T10:46:28.613', 'AnswerCount': '0', 'CommentCount': '2', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '16444', 'Tags': '<programming-languages><object-oriented>', 'CreationDate': '2014-04-22T00:43:59.960', 'Id': '24010''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}{'Body': '<p>In c++, I have a class, say <code>T</code>. It is meaningful to construct an object as\n<code>T t();</code>\nbut not as\n<code>T();</code>. Can the second version be blocked?</p>\n', 'ViewCount': '16', 'ClosedDate': '2014-04-29T18:25:10.717', 'Title': 'Enforce variable creation', 'LastActivityDate': '2014-04-29T16:53:42.650', 'AnswerCount': '0', 'CommentCount': '0', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '16804', 'Tags': '<object-oriented>', 'CreationDate': '2014-04-29T16:53:42.650', 'Id': '24228''color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2}