{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>When reporting algorithmic complexity of an algorithm, one assumes the underlying computations are performed on some abstract machine (e.g. RAM) that approximates a modern CPU. Such models allow us to report time and space complexity of algorithms. Now, with the spread out of <a href="http://en.wikipedia.org/wiki/GPGPU">GPGPUs</a>, one wonders whether there are well known models where one can take into account power consumption as well.</p>\n\n<p>GPUs are well known to consume considerable amount of power and certain instructions fall into different categories of power consumption based on their complexity and location on the sophisticated chip. Hence instructions, from an energy of view, are not of unit (or even fixed) cost. A trivial extension would be assigning weights to operation cost, but I\'m looking for a powerful model where an operation/instruction might cost <em>non-constant</em> units of energy, e.g. polynomial amount (or even more complex e.g.: function of time elapsed since start of the algorithm; or taking into account probability of failure of cooling system, which will heat up the chips, and slow down the clock frequency etc.)</p>\n\n<p>Are there such models where non-trivial costs and faults can be incorporated?</p>\n', 'ViewCount': '144', 'Title': 'Is there an abstract machine that can capture power consumption?', 'LastEditorUserId': '48', 'LastActivityDate': '2012-03-26T15:00:28.613', 'LastEditDate': '2012-03-13T02:52:43.603', 'AnswerCount': '3', 'CommentCount': '1', 'AcceptedAnswerId': '281', 'Score': '9', 'OwnerDisplayName': 'user20', 'PostTypeId': '1', 'Tags': '<complexity-theory><computer-architecture><power-consumption><machine-models>', 'CreationDate': '2012-03-13T00:48:16.690', 'Id': '271'}}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I am currently reviewing the potentials of cloud computing regarding energy efficiency and green IT. In connection with this review I am having a look on techniques for increasing energy-efficiency in data centers (computing), hardware, networking and storage devices.</p>\n\n<p>Specificially for computing/servers I have found already a few:</p>\n\n<ul>\n<li>energy-aware scheduling techniques utilizing frequency and voltage scaling </li>\n<li>virtualization to consolidate server resources</li>\n<li>energy-saving hardware, e.g. ACPI, several processor techniques, especially for mobile devices etc.</li>\n</ul>\n\n<p>However, for networking devices it is rather hard to get information about energy-saving technologies. I have read that people are thinking about new protocols and alternative routing methods to be able to switch off hardware if the network is under low load. Does anyone know of such examples? </p>\n\n<p>Which other points should be added, either for networking or computing</p>\n', 'ViewCount': '146', 'Title': 'What techniques exist for energy-efficient computing and networking?', 'LastEditorUserId': '98', 'LastActivityDate': '2012-07-24T15:04:08.463', 'LastEditDate': '2012-05-10T15:17:18.700', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '1413', 'Tags': '<reference-request><computer-architecture><operating-systems><computer-networks><power-consumption>', 'CreationDate': '2012-05-08T10:05:00.307', 'Id': '1729'}}{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '628', 'Title': 'What is the most power/energy efficient sorting algorithm?', 'LastEditDate': '2013-08-01T12:57:53.000', 'AnswerCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '7858', 'FavoriteCount': '1', 'Body': '<p>I am writing a Android phone application that needs to be very power efficient, and I would like to use the most power efficient sorting algorithm. I will implement it in C for extra power efficiency. What algorithm is the most power efficient algorithm for sorting arbitrary text strings?</p>\n', 'Tags': '<algorithms><sorting><efficiency><power-consumption>', 'LastEditorUserId': '98', 'LastActivityDate': '2013-08-01T13:10:14.323', 'CommentCount': '6', 'AcceptedAnswerId': '13549', 'CreationDate': '2013-07-31T22:27:29.337', 'Id': '13548'}}