{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>I am a high school student computationally studying the 3-dimensional structure of chromosomes by 40 kilobase loci. In a nutshell, loci that are close in space tend to express their genes at the same time --- loci are different stops on a 3D-winding DNA chain.</p>\n\n<p>The best way to understand the 3D structure is by gathering what are basically distances between loci.</p>\n\n<p>Now I have an $n\\times n$ ($n$ = number of loci studied) matrix where $(i,j)$ is the distance between locus $i$ and locus $j$. I also have a (somewhat miraculous) 3-dimensional of the same chromosome that maps each locus to a certain point in a 3D $(x,y,z)$ coordinate system.</p>\n\n<p>My task is to find all of the loci within a certain radius of locus $L$. With the matrix, I would have to go to $L$ and traverse many nearby locus-distance chains, possibly for a long time, before being any bit certain that I had everything I wanted (i.e. brute force). With the spatial model, I would only have to conduct a simple search within that radius.</p>\n\n<p>Here is my question. What is the complexity of finding nearby loci in the 3D model and the 2D matrix with respect to loci count and radius size (whichever you think is more complex)? (Compare the two complexities and give both)</p>\n\n<p>I am not very studied in CS, but here is what I guess:</p>\n\n<p>$$\nC_{2D search best-case} = O(n^2)\n$$\n$$\nC_{2D search worst-case} = O(2^n)\n$$</p>\n\n<p>Best-case is what you'd expect, and worst-case would be going through every permutation of the distance.</p>\n\n<p>$$\nC_{3D search any case} = O(n)\n$$</p>\n\n<p>This is just my rather fallible intuition.</p>\n", 'ViewCount': '57', 'Title': 'Time complexity of proximity search in distance matrix', 'LastEditorUserId': '98', 'LastActivityDate': '2014-02-17T19:14:00.307', 'LastEditDate': '2014-02-17T09:59:29.453', 'AnswerCount': '1', 'CommentCount': '1', 'AcceptedAnswerId': '21721', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '14736', 'Tags': '<algorithm-analysis><runtime-analysis><search-algorithms><ralgorithms>', 'CreationDate': '2014-02-17T00:27:33.090', 'Id': '21711'}}