{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Is there any evidence suggesting that time spent on writing up, or thinking about the requirements will have any effect on the development time? Study done by Standish (1995) suggests that incomplete requirements partially (13.1%) contributed to the failure of the projects. Are there any studies done which show that time spent on requirement analysis will have any effect on development time of a project, or how successful the project will be.</p>\n', 'ViewCount': '904', 'Title': 'Time spent on requirement and its effect on project success and development time', 'LastEditorUserId': '5', 'LastActivityDate': '2012-03-10T19:27:57.383', 'LastEditDate': '2012-03-07T07:46:53.500', 'AnswerCount': '2', 'CommentCount': '4', 'Score': '9', 'PostTypeId': '1', 'OwnerUserId': '5', 'Tags': '<software-engineering>', 'CreationDate': '2012-03-07T07:07:58.403', 'Id': '75'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>The halting problem cannot be solved in the general case. It is possible to come up with defined rules that restrict allowed inputs and can the halting problem be solved for that special case?</p>\n\n<p>For example, it seems likely that a language that does not allow loops for instance, would be very easy to tell if the program would halt or not.</p>\n\n<p>The problem I'm trying to solve right now is that I'm trying to make a script checker that checks for the validity of the program. Can halting problem be solved if I know exactly what to expect from script writers, meaning very predictable inputs. If this cannot be solved exactly, what are some good approximation techniques to solve this?</p>\n", 'ViewCount': '242', 'Title': 'Is it possible to solve the halting problem if you have a constrained or a predictable input?', 'LastEditorUserId': '41', 'LastActivityDate': '2012-03-13T00:49:09.953', 'LastEditDate': '2012-03-13T00:20:34.387', 'AnswerCount': '5', 'CommentCount': '0', 'Score': '9', 'PostTypeId': '1', 'OwnerUserId': '5', 'Tags': '<computability><undecidability><software-engineering><formal-methods>', 'CreationDate': '2012-03-12T23:00:03.130', 'Id': '258'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '2545', 'Title': 'How are statistics being applied in computer science to evaluate accuracy in research claims?', 'LastEditDate': '2014-02-08T00:50:08.267', 'AnswerCount': '4', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '983', 'FavoriteCount': '3', 'Body': '<p>I have noticed in my short academic life that many published papers in our area sometimes do not have much rigor regarding statistics. This is not just an assumption; I have heard professors say the same. </p>\n\n<p>For example, in CS disciplines I see papers being published claiming that methodology X has been observed to be effective and this is proved by ANOVA and ANCOVA, however I see no references for other researchers evaluating that the necessary constraints have been observed. It somewhat feels like as soon as some \'complex function and name\' appears, then that shows the researcher is using some highly credible method and approach that \'he must know what is he doing and it is fine if he does not describe the constraints\', say, for that given distribution or approach, so that the community can evaluate it. </p>\n\n<p>Sometimes, there are excuses for justifying the hypothesis with such a small sample size. </p>\n\n<p>My question here is thusly posed as a student of CS disciplines as an aspirant to learn more about statistics: How do computer scientists approaches statistics? </p>\n\n<p>This question might seems like I am asking what I have already explained, but that is my <em>opinion</em>. I might be wrong, or I might be focusing on a group of practitioners whereas other groups of CS researchers might be doing something else that follows better practices with respect to statistics rigor. </p>\n\n<p>So specifically, what I want is "Our area is or is not into statistics because of the given facts (papers example, books, or another discussion article about this are fine)". @Patrick answer is closer to this. </p>\n', 'Tags': '<software-engineering><empirical-research><statistics>', 'LastEditorUserId': '472', 'LastActivityDate': '2014-02-08T17:39:10.957', 'CommentCount': '4', 'AcceptedAnswerId': '1101', 'CreationDate': '2012-04-07T01:53:58.053', 'Id': '1100'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I am wondering if there are any experiments that show the existence or the non-existence of a correlation between usage of a dynamic language (such as Python, Ruby, or even languages that run on the Java platform such as Groovy, Clojure) over a static language (such as C/C++), and the difference in the productivity.</p>\n', 'ViewCount': '298', 'Title': 'Is there evidence that using dynamic languages has an impact on productivity?', 'LastEditorUserId': '5', 'LastActivityDate': '2014-01-21T16:55:55.333', 'LastEditDate': '2012-05-26T15:14:02.587', 'AnswerCount': '2', 'CommentCount': '7', 'Score': '17', 'PostTypeId': '1', 'OwnerUserId': '5', 'Tags': '<programming-languages><empirical-research><software-engineering>', 'CreationDate': '2012-04-09T00:54:11.487', 'FavoriteCount': '4', 'Id': '1150'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>Having extracted the data-flow in some rather large programs as directed, acyclic graphs, I'd now like to optimize the order of evaluation to minimze the maximum amount of memory used.</p>\n\n<p>That is, given a graph {1 -> 3, 2 -> 3, 4 -> 5, 3 -> 5}, I'm looking for an algorithm that will decide the order of graph reduction to minimize the number of 'in-progress' nodes, in this particular case to decide that it should be reduced in the order 1-2-3-4-5; avoiding the alternative ordering, in this case 4-1-2-3-5, which would leave the output from node 4 hanging until 3 is also complete.</p>\n\n<p>Naturally, if there are two nodes using the output from a third, then it only counts once; data is not copied unnecessarily, though it does hang around until both of those nodes are reduced.</p>\n\n<p>I would also quite like to know what this problem is called, if it has a name. It looks similar to the graph bandwidth problem, only not quite; the problem statement may be defined in terms of path/treewidth, but I can't quite tell, and am unsure if I should prioritize learning that branch of graph theory right now.</p>\n", 'ViewCount': '126', 'Title': 'Optimizing order of graph reduction to minimize memory usage', 'LastEditorUserId': '41', 'LastActivityDate': '2012-05-10T03:23:26.373', 'LastEditDate': '2012-05-10T03:23:26.373', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '6', 'PostTypeId': '1', 'OwnerUserId': '1425', 'Tags': '<algorithms><graphs><optimization><software-engineering><program-optimization>', 'CreationDate': '2012-05-09T12:07:24.633', 'FavoriteCount': '1', 'Id': '1752'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '501', 'Title': 'How do you check if two algorithms return the same result for any input?', 'LastEditDate': '2012-05-25T20:16:22.707', 'AnswerCount': '4', 'Score': '9', 'OwnerDisplayName': 'Andres Riofrio', 'PostTypeId': '1', 'OwnerUserId': '1638', 'FavoriteCount': '2', 'Body': u'<p>How do you check if two algorithms (say, Merge sort and Na\xefve sort) return the same result for any input, when the set of all inputs is infinite?</p>\n\n<p><strong>Update:</strong> Thank you <a href="http://cs.stackexchange.com/a/2062/1638">Ben</a> for describing how this is impossible to do algorithmically in the general case. <a href="http://cs.stackexchange.com/a/2063/1638">Dave\'s answer</a> is a great summary of both algorithmic and manual (subject to human wit and metaphor) methods that don\'t always work, but are quite effective.</p>\n', 'Tags': '<computability><formal-methods><software-engineering><software-verification><program-verification>', 'LastEditorUserId': '1638', 'LastActivityDate': '2012-05-25T20:16:22.707', 'CommentCount': '8', 'CreationDate': '2012-05-25T00:03:21.817', 'Id': '2059'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>The slides from my course in software architecture hints that these are seperate terms, but I can't seem to find the difference. Aren't all of them just translating interfaces?</p>\n", 'ViewCount': '800', 'Title': "What's the difference between a bridge, a mediator and a wrapper?", 'LastEditorUserId': '98', 'LastActivityDate': '2012-06-15T14:30:32.003', 'LastEditDate': '2012-06-08T18:39:15.737', 'AnswerCount': '3', 'CommentCount': '2', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '1797', 'Tags': '<terminology><software-engineering>', 'CreationDate': '2012-06-08T14:19:23.567', 'FavoriteCount': '4', 'Id': '2284'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>The <a href="http://en.wikipedia.org/wiki/Expression_problem" rel="nofollow">Expression Problem</a>, populated by Philip Wadler,  is a often used to standard problem to evaluate programming languages.</p>\n\n<p>I think it is a very clear and popular example and I wonder if there are any similar standard problems that are possibly also as widely used and as clear.</p>\n\n<p>So, are there any similar standard problems?</p>\n\n<p>(In the case of Feature Oriented Programming (<a href="http://en.wikipedia.org/wiki/Feature_Oriented_Programming" rel="nofollow">link</a> <a href="http://en.wikipedia.org/wiki/FOSD_Program_Cubes#Applications" rel="nofollow">link</a>) I found some standard problems, like:\n- implementation of a stack with different features\n- implementation of linked lists\n- implementation of a calculator\n- the graph product line\n- stock broker and bank account examples\n- hierarchical display\n)</p>\n', 'ViewCount': '84', 'Title': u'Expression Problem – looking for a similar standard problem', 'LastActivityDate': '2012-06-11T20:57:37.057', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<reference-request><programming-languages><software-engineering>', 'CreationDate': '2012-06-11T15:36:59.607', 'Id': '2332'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p><strong>Background:</strong> Some people consider Software Engineering as a branch of Computer Science, while others consider that they are, or should be, separate. The former stance seems to be well presented in written works. On Wikipedia, Software Engineering <a href="http://en.wikipedia.org/wiki/Computer_science#Areas_of_computer_science" rel="nofollow">is classified as Applied Computer Science</a>, along with, e.g., Artificial Intelligence and Cryptography. The <a href="http://www.acm.org/about/class/ccs98-html" rel="nofollow">ACM Computing Classification</a> system places SE under Software, along with, e.g., Programming Languages and Operating Systems. <a href="http://www.csab.org/" rel="nofollow">CSAB</a> has also <a href="http://web.archive.org/web/20090117183438/http://www.csab.org/comp_sci_profession.html" rel="nofollow">considered SE as part of Computer Science</a>, and considered that</p>\n\n<blockquote>\n  <p>[...] it includes theoretical studies, experimental methods, and engineering design all in one discipline. [...] It is this close interaction of the theoretical and design aspects of the field that binds them together into a single discipline.<br>\n  [...]<br>\n  Clearly, the computer scientist must not only have sufficient training in the computer science areas to be able to accomplish such tasks, but must also have a firm understanding in areas of mathematics and science, as well as a broad education in liberal studies to provide a basis for understanding the societal implications of the work being performed.</p>\n</blockquote>\n\n<p>While the above seems to reflect my own view, there is also the stance that the term Computer Science should be reserved for what is sometimes called Theoretical Computer Science, such as Computability Theory, Computational Complexity Theory, Algorithms and Data Structures, and that other areas should be split off into their own disciplines. In the introductory courses I took for my CS degree, the core of CS was defined via the questions "what can be automated?" (Computability Theory) and "what can be automated efficiently?" (Computational Complexity Theory). The "how" was then explored at length in the remaining courses, but one could well consider SE being so far from these core questions that it shouldn\'t be considered part of CS.</p>\n\n<p>Even <a href="http://meta.cs.stackexchange.com/questions/39/what-is-our-stance-on-software-engineering">here on CS.SE</a>, there has been debate about whether SE questions are on-topic, reflecting the problematic relationship between CS and SE.</p>\n\n<p><strong>Question:</strong> I\'m wondering what lines of reasoning and traditions within Computer Science might lead to one conclusion or the other: that SE is, or should be, part of CS or that it is not. (This implies that answers should present both sides.)</p>\n', 'ViewCount': '279', 'Title': "What different lines of reasoning and traditions leads to the conclusion that Software Engineering is or isn't part of Computer Science?", 'LastActivityDate': '2012-09-17T17:54:20.120', 'AnswerCount': '2', 'CommentCount': '20', 'AcceptedAnswerId': '4596', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '187', 'Tags': '<software-engineering>', 'CreationDate': '2012-08-10T11:54:13.147', 'FavoriteCount': '2', 'Id': '3115'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '145', 'Title': 'References on collective intelligence with respect to CS applications', 'LastEditDate': '2012-09-28T16:28:05.587', 'AnswerCount': '1', 'Score': '-4', 'PostTypeId': '1', 'OwnerUserId': '699', 'FavoriteCount': '1', 'Body': '<p>In recent years the field of "collective intelligence" sometimes known as <a href="http://en.wikipedia.org/wiki/Web_2.0" rel="nofollow">Web 2.0</a> has had a big impact on computer science, software engineering, and software development. Stackexchange software itself is a large scale evolving application or implementation and experiment along the lines of harnessing collective intelligence. </p>\n\n<blockquote>\n  <p>What are some references especially with a CS angle on this connection between collective intelligence/Web 2.0 and CS?</p>\n</blockquote>\n', 'Tags': '<reference-request><education><software-engineering><books>', 'LastEditorUserId': '472', 'LastActivityDate': '2012-09-28T16:28:05.587', 'CommentCount': '5', 'AcceptedAnswerId': '4769', 'CreationDate': '2012-09-27T18:26:13.057', 'Id': '4768'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '670', 'Title': 'What do these arrows in design pattern diagrams mean?', 'LastEditDate': '2012-12-04T17:00:58.440', 'AnswerCount': '3', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '2860', 'FavoriteCount': '1', 'Body': '<p>I am learning about software design patterns by reading Wikipedia pages about them. A lot of the patterns such as the bridge pattern have diagrams with boxes and different kinds of arrows:</p>\n\n<p><a href="http://i.stack.imgur.com/ZPF7S.png" rel="nofollow"><img src="http://i.stack.imgur.com/ZPF7S.png" alt="enter image description here"></a><br>\n<sup>Source: <a href="http://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Bridge_UML_class_diagram.svg/500px-Bridge_UML_class_diagram.svg.png" rel="nofollow">Wikipedia</a></sup></p>\n\n<p>Do these diagrams stem from a standard? Why do some arrows have different ending markings? Also, why are some of them dotted?</p>\n', 'Tags': '<terminology><software-engineering>', 'LastEditorUserId': '98', 'LastActivityDate': '2012-12-04T17:01:37.473', 'CommentCount': '1', 'AcceptedAnswerId': '6974', 'CreationDate': '2012-11-28T00:02:46.693', 'Id': '6973'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I am building a system and I have a couple of architectures in mind. I want to have an idea of which architecture is likely to be most performant (quickest).</p>\n\n<p>I can make different decisions like \n1) Do everything in one thread\n2) Separate this part into one thread, that part into another thread since it can run in parallel and so on</p>\n\n<p>Instead of actually building the system in two different ways and seeing how it performs, is there a way to quickly model/prototype the system where I can express the above concepts and the times it takes for inter thread I/O etc (of which I have a very good estimate) and use the model/prototype to estimate which architecture is better?</p>\n', 'ViewCount': '42', 'Title': 'Modeling timing characterists of an architecture', 'LastEditorUserId': '98', 'LastActivityDate': '2013-03-26T17:22:25.630', 'LastEditDate': '2013-03-26T17:22:25.630', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '6981', 'Tags': '<efficiency><software-engineering>', 'CreationDate': '2013-02-21T21:08:49.160', 'Id': '10020'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': u'<p>Small introduction. We have a task that consists of sub-tasks. Each sub-task can be implemented by some set of web-services. We want to find the best implementation of this task. "Best" means it has best values of QoS (availability, latency, cost etc.).</p>\n\n<p>So there are plenty of works:</p>\n\n<ol>\n<li>Canfora G. и др. An approach for QoS-aware service composition based on genetic algorithms // Proceedings of the 2005 conference on Genetic and evolutionary computation. New York, NY, USA: ACM, 2005. С. 1069–1075.</li>\n<li>Hwang S.-Y. и др. A probabilistic approach to modeling and estimating the {QoS} of web-services-based workflows // Information Sciences. 2007. Т. 177. № 23. С. 5484–5503.</li>\n<li>Klein A., Fuyuki I., Honiden S. SanGA: A Self-Adaptive Network-Aware Approach to Service Composition // Services Computing, IEEE Transactions on. 2013. Т. 1. № 99.</li>\n<li>Zhao X. и др. A hybrid clonal selection algorithm for quality of service-aware web-service selection problem // International Journal of Innovative Computing, Information and Control (IJICIC). 2012. Т. 8. № 12. С. 8527–8544.</li>\n<li>Lots of others works. I have at least 10 such papers in my Mendeley catalog.</li>\n</ol>\n\n<p>that solve a task of QoS-aware service composition using information about workflow structure. Workflow consists of composition of sequence, loop, parallel and exclusive choice patterns. They computes integral value of QoS for each possible composition and then make a choice between compositions with best integral QoS-values.</p>\n\n<p>By "integral" I mean for example: integral latency for sequence = mean latency of 1st WS  + ... + mean latency for last WS in sequence</p>\n\n<p><strong>So the question is this approach better then approach of finding best choice for each sub-task separately</strong>? So the best implementation of task equals best implementations of sub-tasks.</p>\n\n<p>Seems to me the last one approach is much more simpler and more clear in terms of choosing not only best options, but best options that satisfy preferences of engineer who make decision of final web-services composition.</p>\n', 'ViewCount': '51', 'Title': 'Is there difference between workflow-aware and non-workflow-aware optimal selection of web-service composition?', 'LastEditorUserId': '7589', 'LastActivityDate': '2013-04-05T16:57:09.897', 'LastEditDate': '2013-04-05T16:57:09.897', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '7589', 'Tags': '<software-engineering><software-testing>', 'CreationDate': '2013-04-05T04:51:54.137', 'Id': '11039'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Below, is the mapping of class diagram to object diagram correct? i cant seem to find a useful tutorial on object diagrams anywhere! </p>\n\n<p><img src="http://i.stack.imgur.com/qG5Wa.png" alt="enter image description here"></p>\n\n<p>Thanks in advance!</p>\n', 'ViewCount': '90', 'Title': 'Extracting an object diagram to a class diagram', 'LastEditorUserId': '7492', 'LastActivityDate': '2013-05-12T23:17:15.297', 'LastEditDate': '2013-05-12T23:17:15.297', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '8054', 'Tags': '<software-engineering><object-oriented>', 'CreationDate': '2013-05-12T14:25:41.470', 'Id': '11970'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>For my thesis, I have created a development approach (consisting of schemes, an application template and prototype code) that should make it easier to develop and adapt applications for a specific platform.</p>\n\n<p>I have conducted interviews with developers of that platform to evaluate my approach. There where 5 interviewees and the feedback that I got from them is sufficient for my scope, I would say.</p>\n\n<p>However, in my thesis I would like to justify my decision that 5 evaluators are enough. Is there any scientific research or paper that suggests a certain number of evaluators for such a rather theoretical approach?</p>\n\n<p>I know <a href="http://www.nngroup.com/articles/how-to-conduct-a-heuristic-evaluation/" rel="nofollow">Nielsen\'s work about heuristic usability evaluation</a> which says that with 5 participants, you discover around 75% of all problems in <em>software usability / UI testing</em>.</p>\n\n<p>But as I said, my approach is no specific software product that has to be evaluated, but only the model itself, which is why I\'m looking for research in that area.</p>\n', 'ViewCount': '58', 'Title': 'Ideal number of participants for evaluation of development approach / software architecture', 'LastEditorUserId': '98', 'LastActivityDate': '2013-09-02T10:27:33.920', 'LastEditDate': '2013-09-02T10:25:45.363', 'AnswerCount': '1', 'CommentCount': '3', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '8450', 'Tags': '<reference-request><software-engineering><empirical-research>', 'CreationDate': '2013-05-30T18:52:54.170', 'Id': '12378'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '328', 'Title': 'Difference between Computing Architecture and Platform in Computer Science', 'LastEditDate': '2013-06-30T18:48:15.417', 'AnswerCount': '2', 'Score': '3', 'OwnerDisplayName': 'Espanta', 'PostTypeId': '1', 'OwnerUserId': '8906', 'FavoriteCount': '1', 'Body': '<p>I was looking for an appropriate term to call my proposal. I knew it is either platform or architecture. But could not simply and clearly distinguish them in an academic manner. So, I searched the web and the literature and found few definitions on architecture and platform as follows that sound logical.</p>\n\n<ul>\n<li>Software Architecture: A set of system elements and relations associated with them [reference: documenting software architecture: views and beyond]</li>\n<li>Platform: A set of subsystems and technologies providing a coherent set of functionalities through interfaces and specified usage pattern that any subsystem that depends on the platform can use without concern of the detail of how the functionality provided by the platform is implemented<a href="http://portals.omg.org/dds/sites/default/files/dds_security_rfp_mars_10-12-37.pdf" rel="nofollow">1</a>.</li>\n</ul>\n\n<p>However, still is it not clear what are the differences. I guess researchers often use these two terms interchangeably with marginal consideration on their differentiations. Looking at the definitions, I figured out that architecture likely specifies structural properties of systems and usually tries to describe the structure of a system and its consisting components and their relationship. Using architecture, developers cannot produce a system that works according to that architecture. However, platform is trying to specify structural and behavioural attribute of a system by describing its subsystems and their relationship. Platform also provides an abstract by which developers can create new software systems that rely upon the platform. </p>\n\n<p>Is this interpretation accurate enough? One may argue that platform is prepared on top of an architecture and without architecture one may not be able to propose platform. </p>\n\n<p>In your idea, what else are the differences and distinguishing lines between these two terms?</p>\n', 'Tags': '<terminology><software-engineering>', 'LastEditorUserId': '98', 'LastActivityDate': '2013-11-24T13:16:28.013', 'CommentCount': '4', 'CreationDate': '2013-06-28T08:08:04.147', 'Id': '12958'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>I'm looking for empirical papers which investigate if a user can benefit from Q&amp;A sites like Stack Overflow. I welcome any papers related to this topic, e.g: </p>\n\n<ul>\n<li>an experiment, investigating if a specific task can be executed faster,</li>\n<li>an analysis, investigating if a user understands the solutions on Q&amp;A sites or if he just does copy&amp;paste without thinking about it,</li>\n<li>a comparative analysis of the code quality of users with access to Q&amp;A sites in contrast to users without internet access (but just offline documentation of APIs).</li>\n</ul>\n", 'ViewCount': '112', 'Title': 'Empirical studies about benefits of Q&A sites for programming', 'LastEditorUserId': '1636', 'LastActivityDate': '2014-01-24T14:29:31.617', 'LastEditDate': '2013-07-04T01:32:24.893', 'AnswerCount': '2', 'CommentCount': '2', 'Score': '3', 'PostTypeId': '1', 'OwnerUserId': '8988', 'Tags': '<reference-request><software-engineering><empirical-research><social-networks>', 'CreationDate': '2013-07-03T11:36:45.447', 'Id': '13056'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Does anyone know where I could get an access to a project that contains all the artefacts (documents) that were created during the development? So I would like to get all the word, pdf, power designer, etc. files as well as all the source code. If possible, I would prefer that all this files are stored in some of the software reporitories.</p>\n', 'ViewCount': '26', 'ClosedDate': '2013-08-28T20:23:30.753', 'Title': 'Access to publicly available project with all the artefacts (files) created during the development', 'LastEditorUserId': '98', 'LastActivityDate': '2013-08-28T09:32:03.657', 'LastEditDate': '2013-08-28T09:32:03.657', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '9853', 'Tags': '<reference-request><software-engineering><data-sets>', 'CreationDate': '2013-08-27T10:40:59.360', 'Id': '13970'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Well everything is in the title.  </p>\n\n<p>After all <a href="http://en.wikipedia.org/wiki/Siri" rel="nofollow">Siri</a> voice was made from someone, so can I\nuse software to make a computer generated voice sound\nlike my voice or anybody else?</p>\n', 'ViewCount': '54', 'Title': 'Do we know how to make a "voice print" and use it for computer generated voice?', 'LastEditorUserId': '268', 'LastActivityDate': '2013-11-11T21:00:39.790', 'LastEditDate': '2013-11-11T21:00:39.790', 'AnswerCount': '1', 'CommentCount': '1', 'Score': '4', 'PostTypeId': '1', 'OwnerUserId': '11319', 'Tags': '<software-engineering>', 'CreationDate': '2013-11-11T20:09:19.887', 'Id': '17926'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>When we are trying to learn a new language without any help from native speakers, the first thing we need is something/someone to correct our grammatical mistakes/improper word selection.</p>\n\n<p>So is there any research done on building tools to help critique our spoken language? I often hear people saying that the more you try to speak, the better you get, so I'm wondering if automated tools could help provide feedback on our attempts at speaking in the new language.</p>\n", 'ViewCount': '66', 'Title': 'Automatic speech correction', 'LastEditorUserId': '755', 'LastActivityDate': '2013-11-16T02:16:48.197', 'LastEditDate': '2013-11-16T02:16:48.197', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '11367', 'Tags': '<formal-grammars><software-engineering><language>', 'CreationDate': '2013-11-14T04:07:07.853', 'Id': '18003'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I am a CS student.when I first came to school, I thought that programming was  to make a software.Now I found I was wrong .Now I want to know what  the difference is ? and what is the differences between a programmer and a software engineer(and I prefer this)? I hope people can give me some advice.(forgive my broken English) </p>\n', 'ViewCount': '61', 'Title': 'Software or program ,what is the difference?', 'LastEditorUserId': '268', 'LastActivityDate': '2013-11-30T18:27:16.123', 'LastEditDate': '2013-11-30T06:13:04.763', 'AnswerCount': '3', 'CommentCount': '1', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '11691', 'Tags': '<software-engineering>', 'CreationDate': '2013-11-30T04:32:41.220', 'Id': '18483'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>There seems to be a classification of processes in IT. For example, "business process" refers to the collection of tasks done by organization members / software systems to achieve a goal.</p>\n\n<p>If a process is completely automated and carried out by software (no people involved) what is the process called? Say we have a Web service A and service B online and we have a process that automatically uses both in achieving a goal.</p>\n\n<p>I googled for "Software process" but the results are not what I am looking for (e.g waterfall)</p>\n\n<p>My apologies if this is not the correct forum to ask this question.\nThanks in advance</p>\n', 'ViewCount': '24', 'Title': 'Process Types and names', 'LastActivityDate': '2013-12-08T22:30:39.417', 'AnswerCount': '1', 'CommentCount': '0', 'AcceptedAnswerId': '18762', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '11933', 'Tags': '<software-engineering>', 'CreationDate': '2013-12-08T20:13:13.517', 'Id': '18757'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I\'m asking here for both the <em>scientific, programmatic, and structural format</em> of a device driver. What does that mean? Basically, <strong>I\'m not asking how to write a driver in general</strong> ... I\'m asking how to structure one to behave as software that can act as the "middleware" between higher-level code and the hardware itself. I\'ve decided to embark on a journey of low-level computer programming (e.g. <a href="http://en.wikipedia.org/wiki/System_programming" rel="nofollow">systems programming</a>)\nto develop reusable software that can "expose" accessibility of hardware memory access by driver calls. </p>\n\n<p>I basically run a freelance group of a small programming team/company, and I\'ve decided to take on development across various retro-gaming platforms from the ground up (those which have decent documentation, or reverse engineering will endue). What I\'m asking here is how would one envision the development or structure of software that can act as a intermediary between the application software and the hardware; developmentally, structurally, and programmatically. My choice of console was originally the Nintendo 64\'s GPU (which I have documentation for). The issue isn\'t with writing the code to access the GPU, it\'s with developing a reusable driver/graphics engine (I\'m new to it).</p>\n\n<p>I would have asked this at <a href="http://programmers.stackexchange.com">Programmers.SE</a>, but they reject these kind of questions since they\'re not about specific programming issues, but about careful design methodologies, modularity, and structuring.</p>\n\n<p>So I\'ll ask again with hope to receive a somewhat explanatory answer on this process ... <strong>how do I go about the design methodology, structural format, or developmental logic to create a piece of software that can be accessed by other software to enable device access modularly? In other words, how do I structure and design a driver (i.e. what procedure should I take in creating such software)?</strong></p>\n\n<p><img src="http://i.stack.imgur.com/bTxpv.jpg" alt="enter image description here"></p>\n\n<p>Again, to clarify, <strong>I am not asking how to write a driver, <em>but how to go about structuring the system, methodology, and behavior of a driver.</em></strong> Are there any specific ways of going about this that prove successful (e.g. certain data types to define behavior for accessibility, methods used in accessing parts of a driver independently, etc.)?</p>\n', 'ViewCount': '84', 'Title': 'How to structure device driver software?', 'LastEditorUserId': '98', 'LastActivityDate': '2014-01-30T10:31:17.667', 'LastEditDate': '2014-01-30T10:31:17.667', 'AnswerCount': '2', 'CommentCount': '2', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '12470', 'Tags': '<operating-systems><software-engineering><api-design>', 'CreationDate': '2013-12-30T20:31:51.440', 'Id': '19386'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>I would like to refute my hypothesis that all safety-critical software (that is, software where errors can have catastrophical consequences, either in terms of human lives or high material costs) is a real-time software (where tasks have timing constraints) by finding interesting counterexamples: systems without timing constraints which are safety-critical.</p>\n\n<p>I tried thinking of several examples, but they always seem somehow related to some physical system (e.g. flight control, radiation therapy, nuclear power) and therefore have some implicit timing constraints/deadlines. Even somewhat contrived "safety-critical" systems such as high-frequency trading are still real-time.</p>\n\n<p>Note: I am not interested in a very specific subset of the code which is timing independent, but on something more complete, consisting of a substantial part of a complete application.</p>\n', 'ViewCount': '90', 'Title': 'Is safety-critical software a subset of real-time software?', 'LastEditorUserId': '39', 'LastActivityDate': '2014-01-06T23:08:17.630', 'LastEditDate': '2014-01-06T23:08:17.630', 'AnswerCount': '3', 'CommentCount': '0', 'AcceptedAnswerId': '19546', 'Score': '0', 'OwnerDisplayName': 'DanGar', 'PostTypeId': '1', 'Tags': '<programming-languages><software-engineering><real-time>', 'CreationDate': '2014-01-06T14:21:45.190', 'Id': '19545'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>this might be a bit philosophical question , but i haven't really gotten a good answer. \nTheoretical computer science vs Software engineer / developer whatever, which one is better for making good money.</p>\n\n<p>I love maths and theoretical computer science. I am very ambitious, slightly arrogant guy from Estonia. I am first yeah Bachelor student, but I don't know where to go from here. I study a lot and i want to be successful and the best at what i do, so all tips are welcome if you think of something that could help me.\nI think 95 % or more of my coursemates don't like maths, they just like programming. I minor in mathematics also , i understand it well and i am the best out of 160 persons in maths. I have done some projects in CS and it is okay, i kind of like it,but i feel like it's not my calling.</p>\n\n<p>I also always look for business oppurtunities, have failed 2 or 3 projects due to funding and other reasons, i won't go into that right now. </p>\n\n<p>My second question is : What CS field i should focus on ? Right now i am thinking of parallel computing, computational neuroscience, artificial intelligence and cryptography. I think these are the fields where i might make some money.</p>\n\n<p>If people ask me where do i see myself in 10-20 years, i usually say that i will be my own employer or something. I understand maths very well and i study it a lot. I also study electrical engineering, chemistry , physics at introductionary level, for fun :). (From coursera, mit open courseware and so on ... ). </p>\n\n<p>My third question is : What I should study to make something innovative in the future, that is high end ? ( this is why I study physics and electrical engineering )</p>\n\n<p>Fourth : Is there a theoretical CS field that I could make my own start-up on ? </p>\n\n<p>Sorry for bad English , I'm learning it also right now :) </p>\n", 'ViewCount': '48', 'ClosedDate': '2014-02-01T15:40:43.047', 'Title': 'Making a career in CS vs Software engineer', 'LastActivityDate': '2014-02-01T11:58:00.973', 'AnswerCount': '0', 'CommentCount': '3', 'Score': '1', 'PostTypeId': '1', 'OwnerUserId': '13304', 'Tags': '<software-engineering>', 'CreationDate': '2014-02-01T11:58:00.973', 'Id': '20182'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': "<p>I know math is necessary for application development in simulation software and else.</p>\n\n<p>But I'm learning Python and trying to go deep in PHP, and like to develop applications and extends web servers' capability.</p>\n\n<p>I'm before a big dilemma that whether to learn math professionally or not. I have tried my best to avoid being general on my question.</p>\n\n<p>I have asked this question here because I want to learn it from roots and deal with its scientific aspects.</p>\n", 'ViewCount': '54', 'ClosedDate': '2014-03-09T22:11:56.620', 'Title': 'Is Math a MUST in computer science specificly in Software Development for Web servers', 'LastEditorUserId': '9550', 'LastActivityDate': '2014-03-09T15:48:39.130', 'LastEditDate': '2014-03-09T15:48:39.130', 'AnswerCount': '1', 'CommentCount': '2', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '15448', 'Tags': '<software-engineering>', 'CreationDate': '2014-03-09T13:35:11.857', 'Id': '22429'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'ViewCount': '49', 'Title': 'Control flow graphs - Tree decomposition', 'LastEditDate': '2014-04-18T03:42:01.937', 'AnswerCount': '1', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '11108', 'FavoriteCount': '1', 'Body': '<p><img src="http://i.stack.imgur.com/k1d7R.png" alt="Control flow graphs"></p>\n\n<p>Considering above terminologies for drawing control flow graphs for any program, it is very simple. For example :</p>\n\n<pre><code>While A\nif B\ndo ..\nelse do ..\nend while\n</code></pre>\n\n<p>For above example, while doing decomposition, I can say its </p>\n\n<blockquote>\n  <p>D2 (D1)</p>\n</blockquote>\n\n<p>i.e while  and then inside while, its if-then-else.</p>\n\n<p>Considering same situation. How can you represent </p>\n\n<blockquote>\n  <p>CONTINUE and BREAK statements</p>\n</blockquote>\n\n<p>Ever for  <code>FOR statement</code> there is no defined terminology like for <code>while</code> and <code>if then else</code>. <code>FOR statement</code> falls under <code>while</code>.</p>\n\n<p>My prof says in theory, there is nothing about <code>Break and continue statement</code> and I couldnt find anything online too.</p>\n\n<p>For example :</p>\n\n<pre><code># include &lt;stdio.h&gt;\nint main(){\n   float num,average,sum;\n   int i,n;\n   printf("Maximum no. of inputs\\n");\n   scanf("%d",&amp;n);\n   for(i=1;i&lt;=n;++i){\n       printf("Enter n%d: ",i);\n       scanf("%f",&amp;num);\n       if(num&lt;0.0)\n       break;                     //for loop breaks if num&lt;0.0\n       sum=sum+num;\n}\n  average=sum/(i-1);       \n  printf("Average=%.2f",average);\n  return 0;\n}\n</code></pre>\n\n<p>Control flow graph for this is as below: the nodes has line number written : (Sorry the image is side ways)\n<img src="http://i.stack.imgur.com/jVqRO.jpg" alt="enter image description here"></p>\n\n<p>I decomposed this as : </p>\n\n<pre><code>P1;P1;D2(P1;P1;D1);P1\n\n* P1 represents set of statements outside loops\n</code></pre>\n\n<p>I\'m not sure if this is correct. My professors says to use something as D22 for break, like create a new term from above image.</p>\n\n<blockquote>\n  <p>My main question here is the decomposition. I Know that i drew the\n  CFG correctly, but is the decomposition correct according to the first\n  image?. The break state kind of creates a while as you can see in CFG,\n  but i\'m not sure if it has to be considered as while and I guess we\n  cannot, as per my professor.</p>\n</blockquote>\n\n<p>I am working on this and wanted to know, if anyone has come across something for Break and continue statements while decomposition of graphs, please let me know.</p>\n\n<p>Thanks.</p>\n\n<p>PS : Please, Let me know, if am unclear and if anymore info is needed. I can probably write down an example and upload the picture.</p>\n', 'Tags': '<graphs><software-engineering><software-testing>', 'LastEditorUserId': '11108', 'LastActivityDate': '2014-04-18T12:33:07.703', 'CommentCount': '5', 'AcceptedAnswerId': '23912', 'CreationDate': '2014-04-18T03:27:21.750', 'Id': '23905'}},{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,{'Body': '<p>Dynamic Software Product Lines (DSPLS) are software product lines (SPLs) where features can be bound and unbound during program execution time. </p>\n\n<p>Is there a feature model and code available of an DSPL? I.e., where the model and the implementation is freely available for research purposes? I mean for regular SPLs there is the <a href="http://www.splot-research.org/" rel="nofollow">SPLOT website</a> for models and the several <a href="http://www.infosun.fim.uni-passau.de/spl/apel/Fuji/#download" rel="nofollow">Fuji exmaples</a> with implementaiton code are downloadable.</p>\n\n<p>I contacted one of the authors of a review paper on DSPLs:\nHallsteinsen, S., Hinchey, M., Park, S., &amp; Schmid, K. (2008). Dynamic software product lines. Computer, 41(4), 93-95.</p>\n\n<p>He answered me that he is not aware of any available DSPL! He said that some work is government funded or sponsored by companies and in both cases it is impossible to get anything, let alone code. However, the feature model and code excerpts that I am interested in can be easily anonymised.</p>\n\n<p>Is it true that there is not a single DSPL where the model and some implementation code is availiable?</p>\n\n<p>Are there any research groups I can possibly contact in this regard? Groups that might have a DSPL feature model or implementation that might be available for research? The feature model and implementation code can be anonymized.</p>\n\n<p>The reason for my question is that I am interested in analyzing DSPLs, but it seems impossible to get an DSPL anywhere; although there a numerous papers on DSPLs.</p>\n', 'ViewCount': '16', 'Title': 'Is there an available feature model and code of a dynamic software product line (DSPL)?', 'LastEditorUserId': '98', 'LastActivityDate': '2014-04-30T19:33:43.090', 'LastEditDate': '2014-04-30T17:35:32.730', 'AnswerCount': '0', 'CommentCount': '1', 'Score': '2', 'PostTypeId': '1', 'OwnerUserId': '1829', 'Tags': '<reference-request><software-engineering>', 'CreationDate': '2014-04-30T14:37:16.727', 'FavoriteCount': '1', 'Id': '24258'}},