331_0:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>This problem is about finding a route on a square grid.\nThe starting point is $(1,1)$ and the target point $(n,m)$.\nI can move each step from my current point $(x,y)$ either to $(x+y,y)$ or $(x,y+x)$.\nNow I need to determine if there is a path from $(1,1)$ to $(n,m)$, and if so to return the shortest one.</p>\n\n<p>Now I believe that if I trace back my steps from the input point $(n,m)$ I can always know which move I made out of the two possible ones since if $n=m$ then there is no route, this means I'm always take the smaller coordinate and subtract it from the bigger one.\nBut that means I have at most only one possible route to $(n,m)$ so why was  I asked to return the shortest one?</p>\n\n<p>Am I missing anything ?</p>\n", 'ViewCount': '188', 'Title': u'Route on a square grid with only (x,y) → (x,x+y) and (x,y) → (x+y,y) moves', 'LastEditorUserId': '39', 'LastActivityDate': '2013-04-20T23:28:40.130', 'LastEditDate': '2013-04-20T23:28:40.130', 'AnswerCount': '1', 'CommentCount': '0', 'Score': '5', 'PostTypeId': '1', 'OwnerUserId': '6632', 'Tags': '<algorithms><graph-theory><shortest-path><square-grid>', 'CreationDate': '2013-04-20T13:56:24.683', 'Id': '11427'},331_1:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': "<p>I've got a grid consisting of squares that is 3 squares high and N squares long. \nSome of the squares are filled with numbers that are not greater than 3*N. You can move only to squares that are below, above, on right, or left from you. When you move on a square, you fill that square with a number of the amount of moves you have already taken + 1. If square is already filled with a number, you can move onto it, only if the sum steps you've have taken + 1 is equal to the number on the square.</p>\n\n<p>I need to find a continous path that leads through all the squares of the grid only once and output the same grid filled with numbers corresponding to the steps of your path. In other words, a path was previously laid out on the grid and then some numbers have been erased from squares. Now I have to retrace that path.</p>\n\n<p>I should be done in O(N^2), but I will be thankful for any solutions.</p>\n", 'ViewCount': '83', 'Title': 'Find a continuous path filling whole 3xN grid going through certain points in given order', 'LastActivityDate': '2013-11-03T23:11:59.523', 'AnswerCount': '1', 'CommentCount': '1', 'AcceptedAnswerId': '16683', 'Score': '0', 'PostTypeId': '1', 'OwnerUserId': '11149', 'Tags': '<algorithms><eulerian-paths><square-grid>', 'CreationDate': '2013-11-03T12:30:04.480', 'FavoriteCount': '1', 'Id': '16670'}