2200:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'Body': '<p>Many areas in the world suffer from conflicts between two groups (usually ethnic or religious). For the purpose of this question, I assume that most people of both sides want to live in peace, but there are few extremists who incite hatred and violence. The goal of this question is to find an objective way to filter out those extremists.</p>\n\n<p>Imagine a town with 2 conflicting groups, A and B, each has N people. I propose the following voting scheme (which I explain from the point of view of group A, but it\'s entirely symmetric for the other group):</p>\n\n<ul>\n<li><strong>equality-rule</strong>: The number of people in each group must always remain equal.</li>\n<li><strong>expel-vote</strong>: At any time, each person of group A can claim that a certain person of group B is "extremist", and start a vote. If more than 50% of the people in group A agree, then that certain person is expelled from town.</li>\n<li><strong>counter-vote</strong>: To keep the equality-rule, a single person of group A should also leave the town. This person is selected by a vote between the people in group B (i.e. each person in group B votes for a single person in group A, and the one with most votes is expelled from town).</li>\n</ul>\n\n<p>My intuition is that:</p>\n\n<ul>\n<li>On one hand, this scheme encourages people to be nice to people of the other group, so that they won\'t be subject to expel-votes.</li>\n<li>On the other hand, the equality rule encourages people to think twice before starting an expel-vote, because this will put them in danger of expel in the counter-vote.</li>\n</ul>\n\n<p>[ADDITION]\nSeveral questions can be asked about this scheme, for example:</p>\n\n<ul>\n<li>Under what conditions does it diverge to a situation where people vote and counter-vote, until the number of citizens in one of the groups reaches 0? </li>\n<li>Under what conditions does it stabilize on a situation where the two group has more than 0 citizens? </li>\n<li>Under what conditions, the stable number of citizens is more than half the initial number?</li>\n</ul>\n\n<p>Note that this scheme does not even try to reach an objective measure of "extremism". The only goal is stability.</p>\n\n<p>I would like to know, has this voting scheme has been studied in the past?</p>\n', 'ViewCount': '127', 'Title': 'voting scheme for peaceful coexistence', 'LastEditorUserId': '72', 'LastActivityDate': '2012-06-08T21:14:05.203', 'LastEditDate': '2012-06-07T16:33:57.103', 'AnswerCount': '1', 'CommentCount': '7', 'AcceptedAnswerId': '2291', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '1342', 'Tags': '<reference-request><game-theory><voting>', 'CreationDate': '2012-06-07T09:11:00.850', 'Id': '2249'},2201:{'color':getRandomColor(),'shape':'dot','label':'Strings', 'size': 60, 'isExploded':false, "precedence": 2,'ViewCount': '182', 'Title': 'Is it more effective to vote for a woman?', 'LastEditDate': '2012-11-04T05:57:39.747', 'AnswerCount': '2', 'Score': '7', 'PostTypeId': '1', 'OwnerUserId': '1342', 'FavoriteCount': '1', 'Body': "<p>A certain political party wants to encourage women to participate in their primary elections, so they decide, that the 4th position is reserved for a woman. That is, if there is no woman in the top 4 positions, then the woman with the largest number of votes will be promoted to the 4th position, and the candidates at positions 4 and below (5, 6, 7...) will be demoted one position (of course, if there is initially a woman in one of the top 4 positions, then no promotion/demotion will take place).</p>\n\n<p>There are two candidates that I support equally, one is a man and the other is a woman. Is it true that, if I vote for the woman, my vote is more effective?</p>\n\n<p>In a more extreme case, where the 1st position is reserved for a woman, it's clear that my vote is most effective when I give it to the woman, because this is my only chance of sending my favorite candidate to the 1st position; voting for the man, in this case, will never bring my favorite candidate to the 1st position. </p>\n\n<p>Intuitively, it seems to be the same with the 4th position reserved, because, if I vote for the man and he enters position &lt;=4, he might be demoted, but if I vote for the woman and she enters position &lt;=4, she might be promoted, so my single vote may be worth a lot.</p>\n\n<p>However, I am looking for a formal proof that this is the case (or maybe a disproof?)</p>\n", 'Tags': '<game-theory><voting>', 'LastEditorUserId': '1342', 'LastActivityDate': '2012-11-05T16:17:42.630', 'CommentCount': '2', 'AcceptedAnswerId': '6490', 'CreationDate': '2012-11-01T06:36:52.877', 'Id': '6420'}